Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <module name="RTC" id="6056" version="ZF">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x40100260"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <signals>
              <signal pad="PG30" function="A" group="RTCOUT" index="0"/>
              <signal pad="PG31" function="A" group="RTCOUT" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="RTT" id="6081" version="N">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x40100230"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SFR" id="11066" version="S">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0x400A0000"/>
          </instance>
        </module>
        <module name="SHA" id="6156" version="O">
          <instance name="SHA">
            <register-group address-space="base" name="SHA" name-in-module="SHA" offset="0x40094000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="28"/>
              <param name="INSTANCE_ID" value="44"/>
              <param name="CLOCK_ID" value="44"/>
            </parameters>
          </instance>
        </module>
        <module name="SPW" id="44126" version="A">
          <instance name="SPW">
            <register-group address-space="base" name="SPW" name-in-module="SPW" offset="0x40040000"/>
            <parameters>
              <param name="INSTANCE_ID_SPW" value="65"/>
              <param name="INSTANCE_ID_SPW_TIMETICK" value="66"/>
              <param name="CLOCK_ID_SPWCLK" value="65"/>
              <param name="CLOCK_ID_TIMETICK" value="66"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="44082" version="C">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x40100210"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZO">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40070000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="24"/>
              <param name="DMAC_ID_CPA" value="29"/>
              <param name="DMAC_ID_CPB" value="33"/>
              <param name="DMAC_ID_CPC" value="37"/>
              <param name="DMAC_ID_ETRG" value="41"/>
              <param name="INSTANCE_ID_CHANNEL0" value="25"/>
              <param name="INSTANCE_ID_CHANNEL1" value="26"/>
              <param name="INSTANCE_ID_CHANNEL2" value="27"/>
              <param name="CLOCK_ID_CHANNEL0" value="25"/>
              <param name="CLOCK_ID_CHANNEL1" value="26"/>
              <param name="CLOCK_ID_CHANNEL2" value="27"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PA0" function="B" group="TCLK" index="0"/>
              <signal pad="PA3" function="B" group="TCLK" index="1"/>
              <signal pad="PA6" function="B" group="TCLK" index="2"/>
              <signal pad="PA1" function="B" group="TIOA" index="0"/>
              <signal pad="PA4" function="B" group="TIOA" index="1"/>
              <signal pad="PA7" function="B" group="TIOA" index="2"/>
              <signal pad="PA2" function="B" group="TIOB" index="0"/>
              <signal pad="PA5" function="B" group="TIOB" index="1"/>
              <signal pad="PA8" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40074000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="25"/>
              <param name="DMAC_ID_CPA" value="30"/>
              <param name="DMAC_ID_CPB" value="34"/>
              <param name="DMAC_ID_CPC" value="38"/>
              <param name="DMAC_ID_ETRG" value="42"/>
              <param name="INSTANCE_ID_CHANNEL0" value="28"/>
              <param name="INSTANCE_ID_CHANNEL1" value="29"/>
              <param name="INSTANCE_ID_CHANNEL2" value="30"/>
              <param name="CLOCK_ID_CHANNEL0" value="28"/>
              <param name="CLOCK_ID_CHANNEL1" value="29"/>
              <param name="CLOCK_ID_CHANNEL2" value="30"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB8" function="A" group="TCLK" index="3"/>
              <signal pad="PB11" function="A" group="TCLK" index="4"/>
              <signal pad="PB14" function="A" group="TCLK" index="5"/>
              <signal pad="PB9" function="A" group="TIOA" index="3"/>
              <signal pad="PB12" function="A" group="TIOA" index="4"/>
              <signal pad="PB15" function="A" group="TIOA" index="5"/>
              <signal pad="PB10" function="A" group="TIOB" index="3"/>
              <signal pad="PB13" function="A" group="TIOB" index="4"/>
              <signal pad="PB16" function="A" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40078000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="26"/>
              <param name="DMAC_ID_CPA" value="31"/>
              <param name="DMAC_ID_CPB" value="35"/>
              <param name="DMAC_ID_CPC" value="39"/>
              <param name="DMAC_ID_ETRG" value="43"/>
              <param name="INSTANCE_ID_CHANNEL0" value="53"/>
              <param name="INSTANCE_ID_CHANNEL1" value="54"/>
              <param name="INSTANCE_ID_CHANNEL2" value="55"/>
              <param name="CLOCK_ID_CHANNEL0" value="53"/>
              <param name="CLOCK_ID_CHANNEL1" value="54"/>
              <param name="CLOCK_ID_CHANNEL2" value="55"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PC11" function="A" group="TCLK" index="6"/>
              <signal pad="PC14" function="A" group="TCLK" index="7"/>
              <signal pad="PC17" function="A" group="TCLK" index="8"/>
              <signal pad="PC12" function="A" group="TIOA" index="6"/>
              <signal pad="PC15" function="A" group="TIOA" index="7"/>
              <signal pad="PC18" function="A" group="TIOA" index="8"/>
              <signal pad="PC13" function="A" group="TIOB" index="6"/>
              <signal pad="PC16" function="A" group="TIOB" index="7"/>
              <signal pad="PC19" function="A" group="TIOB" index="8"/>
            </signals>
          </instance>
          <instance name="TC3">
            <register-group address-space="base" name="TC3" name-in-module="TC" offset="0x4007C000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="27"/>
              <param name="DMAC_ID_CPA" value="32"/>
              <param name="DMAC_ID_CPB" value="36"/>
              <param name="DMAC_ID_CPC" value="40"/>
              <param name="DMAC_ID_ETRG" value="44"/>
              <param name="INSTANCE_ID_CHANNEL0" value="56"/>
              <param name="INSTANCE_ID_CHANNEL1" value="57"/>
              <param name="INSTANCE_ID_CHANNEL2" value="58"/>
              <param name="CLOCK_ID_CHANNEL0" value="56"/>
              <param name="CLOCK_ID_CHANNEL1" value="57"/>
              <param name="CLOCK_ID_CHANNEL2" value="58"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PC21" function="D" group="TCLK" index="9"/>
              <signal pad="PC28" function="D" group="TCLK" index="10"/>
              <signal pad="PC25" function="D" group="TCLK" index="11"/>
              <signal pad="PC22" function="D" group="TIOA" index="9"/>
              <signal pad="PC29" function="D" group="TIOA" index="10"/>
              <signal pad="PC26" function="D" group="TIOA" index="11"/>
              <signal pad="PC24" function="D" group="TIOB" index="9"/>
              <signal pad="PC30" function="D" group="TIOB" index="10"/>
              <signal pad="PC27" function="D" group="TIOB" index="11"/>
            </signals>
          </instance>
        </module>
