Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <module name="TCMECC" id="44125" version="A">
          <instance name="TCMECC">
            <register-group address-space="base" name="TCMECC" name-in-module="TCMECC" offset="0x40100400"/>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="K">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40090000"/>
            <parameters>
              <param name="INSTANCE_ID" value="63"/>
              <param name="CLOCK_ID" value="63"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="6080" version="N">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x40100250"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
          <instance name="WDT1">
            <register-group address-space="base" name="WDT1" name-in-module="WDT" offset="0x40100300"/>
            <parameters>
              <param name="INSTANCE_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="N">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40098000"/>
            <parameters>
              <param name="INSTANCE_ID" value="64"/>
              <param name="CLOCK_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SCnSCB">
          <!-- System control Register not in SCB -->
          <instance name="SCnSCB">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SCnSCB" name="SCnSCB"/>
          </instance>
        </module>
        <module name="SCB">
          <instance name="SCB" oldname="SystemControl">
            <register-group address-space="base" offset="0xE000ED00" name-in-module="SCB" name="SCB"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
        <module name="FPU">
          <instance name="FPU">
            <register-group address-space="base" offset="0xE000EF30" name-in-module="FPU" name="FPU"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match" header:alternate-caption="Memory Management Fault"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" header:alternate-caption="Bus Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition" header:alternate-caption="Usage Fault"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor" header:alternate-caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer 0"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="MATRIX0" name="MATRIX0" caption="Matrix 0"/>
        <interrupt index="7" module-instance="FLEXCOM0" name="FLEXCOM0" caption="FLEXCOM 0"/>
        <interrupt index="8" module-instance="FLEXCOM1" name="FLEXCOM1" caption="FLEXCOM 1"/>
        <interrupt index="9" module-instance="NMIC" name="NMIC" caption="NMI Controller"/>
        <interrupt index="10" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="11" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="12" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="13" module-instance="FLEXCOM2" name="FLEXCOM2" caption="FLEXCOM 2"/>
        <interrupt index="14" module-instance="FLEXCOM3" name="FLEXCOM3" caption="FLEXCOM 3"/>
        <interrupt index="15" module-instance="FLEXCOM4" name="FLEXCOM4" caption="FLEXCOM 4"/>
        <interrupt index="16" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller D"/>
        <interrupt index="17" module-instance="PIOE" name="PIOE" caption="Parallel I/O Controller E"/>
        <interrupt index="18" module-instance="SCB" name="CCW" caption="Cache ECC Warning"/>
        <interrupt index="19" module-instance="SCB" name="CCF" caption="Cache ECC Fault"/>
        <interrupt index="20" module-instance="FPU" name="FPU" caption="Floating Point Unit"/>
        <interrupt index="21" module-instance="FPU" name="IXC" caption="Floating Point Unit IXC"/>
        <interrupt index="22" module-instance="FLEXCOM5" name="FLEXCOM5" caption="FLEXCOM 5"/>
        <interrupt index="23" module-instance="FLEXCOM6" name="FLEXCOM6" caption="FLEXCOM 6"/>
        <interrupt index="24" module-instance="FLEXCOM7" name="FLEXCOM7" caption="FLEXCOM 7"/>
        <interrupt index="25" module-instance="TC0" name="TC0" header:alternate-name="TC0_CH0" caption="Timer/Counter 0" header:alternate-caption="Timer/Counter 0 Channel 0"/>
        <interrupt index="26" module-instance="TC0" name="TC1" header:alternate-name="TC0_CH1" caption="Timer/Counter 1" header:alternate-caption="Timer/Counter 0 Channel 1"/>
        <interrupt index="27" module-instance="TC0" name="TC2" header:alternate-name="TC0_CH2" caption="Timer/Counter 2" header:alternate-caption="Timer/Counter 0 Channel 2"/>
        <interrupt index="28" module-instance="TC1" name="TC3" header:alternate-name="TC1_CH0" caption="Timer/Counter 3" header:alternate-caption="Timer/Counter 1 Channel 0"/>
        <interrupt index="29" module-instance="TC1" name="TC4" header:alternate-name="TC1_CH1" caption="Timer/Counter 4" header:alternate-caption="Timer/Counter 1 Channel 1"/>
        <interrupt index="30" module-instance="TC1" name="TC5" header:alternate-name="TC1_CH2" caption="Timer/Counter 5" header:alternate-caption="Timer/Counter 1 Channel 2"/>
        <interrupt index="31" module-instance="PWM0" name="PWM0" caption="Pulse Width Modulation 0"/>
        <interrupt index="32" module-instance="PWM1" name="PWM1" caption="Pulse Width Modulation 1"/>
        <interrupt index="33" module-instance="ICM" name="ICM" caption="Integrity Check Monitor"/>
        <interrupt index="34" module-instance="PIOF" name="PIOF" caption="Parallel I/O Controller F"/>
        <interrupt index="35" module-instance="PIOG" name="PIOG" caption="Parallel I/O Controller G"/>
        <interrupt index="36" module-instance="MCAN0" name="MCAN0_INT0" caption="MCAN Controller 0 Interrupt 0"/>
        <interrupt index="37" module-instance="MCAN0" name="MCAN0_INT1" caption="MCAN Controller 0 Interrupt 1"/>
        <interrupt index="38" module-instance="MCAN1" name="MCAN1_INT0" caption="MCAN Controller 1 Interrupt 0"/>
        <interrupt index="39" module-instance="MCAN1" name="MCAN1_INT1" caption="MCAN Controller 1 Interrupt 1"/>
        <interrupt index="40" module-instance="TCMECC" name="TCMECC_INTFIX" caption="TCM ECC Fixable error detected"/>
        <interrupt index="41" module-instance="TCMECC" name="TCMECC_INTNOFIX" caption="TCM ECC Un-Fixable error detected"/>
        <interrupt index="42" module-instance="FLEXRAMECC" name="FLEXRAMECC_INTFIX" caption="FlexRAM ECC Fixable error detected"/>
        <interrupt index="43" module-instance="FLEXRAMECC" name="FLEXRAMECC_INTNOFIX" caption="FlexRAM ECC Un-Fixable error detected"/>
        <interrupt index="44" module-instance="SHA" name="SHA" caption="Secure Hash Algorithm"/>
        <interrupt index="45" module-instance="FLEXCOM8" name="FLEXCOM8" caption="FLEXCOM 8"/>
        <interrupt index="46" module-instance="FLEXCOM9" name="FLEXCOM9" caption="FLEXCOM 9"/>
        <interrupt index="47" module-instance="WDT1" name="WDT1" caption="Watchdog Timer 1"/>
        <interrupt index="49" module-instance="QSPI" name="QSPI" caption="Quad I/O Serial Peripheral Interface"/>
        <interrupt index="50" module-instance="HEFC" name="HEFC_INT0" caption="HEFC Flash Interrupts"/>
        <interrupt index="51" module-instance="HEFC" name="HEFC_INTFIX" caption="HEFC ECC Fixable error detected"/>
        <interrupt index="52" module-instance="HEFC" name="HEFC_INTNOFIX" caption="HEFC ECC Un-Fixable error detected"/>
        <interrupt index="53" module-instance="TC2" name="TC6" header:alternate-name="TC2_CH0" caption="Timer/Counter 6" header:alternate-caption="Timer/Counter 2 Channel 0"/>
        <interrupt index="54" module-instance="TC2" name="TC7" header:alternate-name="TC2_CH1" caption="Timer/Counter 7" header:alternate-caption="Timer/Counter 2 Channel 1"/>
        <interrupt index="55" module-instance="TC2" name="TC8" header:alternate-name="TC2_CH2" caption="Timer/Counter 8" header:alternate-caption="Timer/Counter 2 Channel 2"/>
        <interrupt index="56" module-instance="TC3" name="TC9" header:alternate-name="TC3_CH0" caption="Timer/Counter 9" header:alternate-caption="Timer/Counter 3 Channel 0"/>
        <interrupt index="57" module-instance="TC3" name="TC10" header:alternate-name="TC3_CH1" caption="Timer/Counter 10" header:alternate-caption="Timer/Counter 3 Channel 1"/>
        <interrupt index="58" module-instance="TC3" name="TC11" header:alternate-name="TC3_CH2" caption="Timer/Counter 11" header:alternate-caption="Timer/Counter 3 Channel 2"/>
        <interrupt index="59" module-instance="HEMC" name="HEMC_INTSDRAMC" caption="HEMC SDRAM Controller"/>
        <interrupt index="60" module-instance="HEMC" name="HEMC_INTFIX" caption="HEMC ECC Fixable error detected"/>
        <interrupt index="61" module-instance="HEMC" name="HEMC_INTNOFIX" caption="HEMC ECC Un-Fixable error detected"/>
        <interrupt index="62" module-instance="SFR" name="SFR"/>
        <interrupt index="63" module-instance="TRNG" name="TRNG" caption="True Random Generator"/>
        <interrupt index="64" module-instance="XDMAC" name="XDMAC" caption="eXtended DMA Controller"/>
        <interrupt index="65" module-instance="SPW" name="SPW" caption="SpaceWire"/>
        <interrupt index="68" module-instance="IP1553" name="IP1553" caption="MIL 1553"/>
        <interrupt index="69" module-instance="GMAC" name="GMAC" caption="Ethernet MAC"/>
        <interrupt index="70" module-instance="GMAC" name="GMAC_Q1" caption="GMAC Queue 1"/>
        <interrupt index="71" module-instance="GMAC" name="GMAC_Q2" caption="GMAC Queue 2"/>
        <interrupt index="72" module-instance="GMAC" name="GMAC_Q3" caption="GMAC Queue 3"/>
        <interrupt index="73" module-instance="GMAC" name="GMAC_Q4" caption="GMAC Queue 4"/>
        <interrupt index="74" module-instance="GMAC" name="GMAC_Q5" caption="GMAC Queue 5"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05D0503F"/>
          <property name="CHIPID_CIDR" value="0xA22F0700"/>
          <property name="CHIPID_EXID" value="0x00000001"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="CHIPID" caption="Chip Identifier" id="6417" version="ZQ">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID" values="CHIPID_EXID__EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
