Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="SAM U70, SAMU71" name="SAMU70SAMU71" value="0x15"/>
        <value caption="SAM V72" name="SAMV72" value="0x16"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
      <value-group caption="" name="CHIPID_EXID__EXID">
        <value caption="100-lead package" name="PACKAGE_TYPE_100" value="0x1"/>
        <value caption="144-lead package" name="PACKAGE_TYPE_144" value="0x2"/>
        <value caption="176-lead package" name="PACKAGE_TYPE_176" value="0x3"/>
      </value-group>
    </module>
    <module name="FLEXCOM" caption="Flexible Serial Communication" id="11268" version="R">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode Register" name="FLEX_MR" offset="0x000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEX_MR__OPMODE"/>
        </register>
        <register caption="FLEXCOM Receive Holding Register" name="FLEX_RHR" offset="0x010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEX_THR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
        <register caption="USART Control Register" name="FLEX_US_CR" offset="0x200" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8 0xA 0xB"/>
          <bitfield caption="Reset Receiver" mask="0x00000004" modes="DEFAULT" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" modes="DEFAULT" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" modes="DEFAULT" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" modes="DEFAULT" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" modes="DEFAULT" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" modes="DEFAULT" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" modes="DEFAULT" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" modes="DEFAULT" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" modes="DEFAULT" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" modes="DEFAULT" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" modes="DEFAULT" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" modes="DEFAULT" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" modes="DEFAULT" name="RSTNACK"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" modes="DEFAULT" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" modes="DEFAULT" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" modes="DEFAULT" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" modes="DEFAULT" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" modes="DEFAULT" name="LINWKUP"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" modes="DEFAULT" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" modes="DEFAULT" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" modes="DEFAULT" name="TXFLCLR"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" modes="DEFAULT" name="REQCLR"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" modes="DEFAULT" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" modes="DEFAULT" name="FIFODIS"/>
        </register>
