Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="USART Mode Register" name="FLEX_US_MR" offset="0x204" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8 0xA 0xB"/>
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" modes="DEFAULT" name="USART_MODE" values="FLEX_US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" modes="DEFAULT" name="USCLKS" values="FLEX_US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" modes="DEFAULT" name="CHRL" values="FLEX_US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" modes="DEFAULT" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" modes="DEFAULT" name="PAR" values="FLEX_US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" modes="DEFAULT" name="NBSTOP" values="FLEX_US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" modes="DEFAULT" name="CHMODE" values="FLEX_US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" modes="DEFAULT" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" modes="DEFAULT" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" modes="DEFAULT" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" modes="DEFAULT" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" modes="DEFAULT" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" modes="DEFAULT" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" modes="DEFAULT" name="VAR_SYNC"/>
          <bitfield caption="Inverted Data" mask="0x00800000" modes="DEFAULT" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" modes="DEFAULT" name="MAX_ITERATION"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" modes="DEFAULT" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" modes="DEFAULT" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" modes="DEFAULT" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" modes="DEFAULT" name="ONEBIT"/>
        </register>
        <register caption="USART Interrupt Enable Register" name="FLEX_US_IER" offset="0x208" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Enable" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Enable" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Enable" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Enable" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Enable" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Enable" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Enable" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Enable" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Enable" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Interrupt Disable Register" name="FLEX_US_IDR" offset="0x20C" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Disable" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Disable" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Disable" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Disable" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Disable" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Disable" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Disable" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Disable" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Disable" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Interrupt Mask Register" name="FLEX_US_IMR" offset="0x210" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Mask" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Mask" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Mask" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Mask" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Mask" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Mask" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Mask" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Mask" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Mask" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Channel Status Register" name="FLEX_US_CSR" offset="0x214" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Status" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" modes="DEFAULT" name="CTS"/>
          <bitfield caption="Manchester Error" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Line Status" mask="0x00800000" modes="LIN_MODE" name="LINBLS"/>
          <bitfield caption="LIN Bit Error" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Error" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
