Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="USART LON Data Length Register" name="FLEX_US_LONDL" offset="0x268" rw="RW" size="4">
          <bitfield caption="LON Data Length" mask="0x000000FF" name="LONDL"/>
        </register>
        <register caption="USART LON L2HDR Register" name="FLEX_US_LONL2HDR" offset="0x26C" rw="RW" size="4">
          <bitfield caption="LON Backlog Increment" mask="0x0000003F" name="BLI"/>
          <bitfield caption="LON Alternate Path Bit" mask="0x00000040" name="ALTP"/>
          <bitfield caption="LON Priority Bit" mask="0x00000080" name="PB"/>
        </register>
        <register caption="USART LON Backlog Register" name="FLEX_US_LONBL" offset="0x270" rw="R" size="4">
          <bitfield caption="LON Node Backlog Value" mask="0x0000003F" name="LONBL"/>
        </register>
        <register caption="USART LON Beta1 Tx Register" name="FLEX_US_LONB1TX" offset="0x274" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Transmission" mask="0x00FFFFFF" name="BETA1TX"/>
        </register>
        <register caption="USART LON Beta1 Rx Register" name="FLEX_US_LONB1RX" offset="0x278" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Reception" mask="0x00FFFFFF" name="BETA1RX"/>
        </register>
        <register caption="USART LON Priority Register" name="FLEX_US_LONPRIO" offset="0x27C" rw="RW" size="4">
          <bitfield caption="LON Priority Slot Number" mask="0x0000007F" name="PSNB"/>
          <bitfield caption="LON Node Priority Slot" mask="0x00007F00" name="NPS"/>
        </register>
        <register caption="USART LON IDT Tx Register" name="FLEX_US_IDTTX" offset="0x280" rw="RW" size="4">
          <bitfield caption="LON Indeterminate Time after Transmission (comm_type = 1 mode only)" mask="0x00FFFFFF" name="IDTTX"/>
        </register>
        <register caption="USART LON IDT Rx Register" name="FLEX_US_IDTRX" offset="0x284" rw="RW" size="4">
          <bitfield caption="LON Indeterminate Time after Reception (comm_type = 1 mode only)" mask="0x00FFFFFF" name="IDTRX"/>
        </register>
        <register caption="USART IC DIFF Register" name="FLEX_US_ICDIFF" offset="0x288" rw="RW" size="4">
          <bitfield caption="IC Differentiator Number" mask="0x0000000F" name="ICDIFF"/>
        </register>
        <register caption="USART Comparison Register" name="FLEX_US_CMPR" offset="0x290" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000001FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="FLEX_US_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x01FF0000" name="VAL2"/>
        </register>
        <register caption="USART FIFO Mode Register" name="FLEX_US_FMR" offset="0x2A0" rw="RW" size="4">
          <bitfield caption="Transmitter Ready Mode" mask="0x00000003" name="TXRDYM" values="FLEX_US_FMR__TXRDYM"/>
          <bitfield caption="Receiver Ready Mode" mask="0x00000030" name="RXRDYM" values="FLEX_US_FMR__RXRDYM"/>
          <bitfield caption="FIFO RTS Pin Control enable (Hardware Handshaking mode only)" mask="0x00000080" name="FRTSC"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x00003F00" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x003F0000" name="RXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold 2" mask="0x3F000000" name="RXFTHRES2"/>
        </register>
        <register caption="USART FIFO Level Register" name="FLEX_US_FLR" offset="0x2A4" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="USART FIFO Interrupt Enable Register" name="FLEX_US_FIER" offset="0x2A8" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Enable" mask="0x00000200" name="RXFTHF2"/>
        </register>
        <register caption="USART FIFO Interrupt Disable Register" name="FLEX_US_FIDR" offset="0x2AC" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Disable" mask="0x00000200" name="RXFTHF2"/>
        </register>
        <register caption="USART FIFO Interrupt Mask Register" name="FLEX_US_FIMR" offset="0x2B0" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Mask" mask="0x00000200" name="RXFTHF2"/>
        </register>
