Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Interrupt Disable Register Priority Queue (1..5)" name="GMAC_IDRPQ" offset="0x620" rw="W" size="4" count="5" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (1..5)" name="GMAC_IMRPQ" offset="0x640" rw="RW" size="4" count="5" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register" name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" count="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register-group caption="Screening Type 2 Compare Word 0 Register" offset="0x700" name="GMAC_ST2CW" size="8" count="24" name-in-module="GMAC_ST2CW"/>
      </register-group>
      <value-group caption="" name="GMAC_NCFGR__CLK">
        <value caption="MCK divided by 8 (MCK up to 20 MHz)" name="MCK_8" value="0x0"/>
        <value caption="MCK divided by 16 (MCK up to 40 MHz)" name="MCK_16" value="0x1"/>
        <value caption="MCK divided by 32 (MCK up to 80 MHz)" name="MCK_32" value="0x2"/>
        <value caption="MCK divided by 48 (MCK up to 120 MHz)" name="MCK_48" value="0x3"/>
        <value caption="MCK divided by 64 (MCK up to 160 MHz)" name="MCK_64" value="0x4"/>
        <value caption="MCK divided by 96 (MCK up to 240 MHz)" name="MCK_96" value="0x5"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__FBLDO">
        <value caption="00001: Always use SINGLE AHB bursts" name="SINGLE" value="0x1"/>
        <value caption="001xx: Attempt to use INCR4 AHB bursts (Default)" name="INCR4" value="0x4"/>
        <value caption="01xxx: Attempt to use INCR8 AHB bursts" name="INCR8" value="0x8"/>
        <value caption="1xxxx: Attempt to use INCR16 AHB bursts" name="INCR16" value="0x10"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__RXBMS">
        <value caption="4/8 Kbyte Memory Size" name="EIGHTH" value="0x0"/>
        <value caption="4/4 Kbytes Memory Size" name="QUARTER" value="0x1"/>
        <value caption="4/2 Kbytes Memory Size" name="HALF" value="0x2"/>
        <value caption="4 Kbytes Memory Size" name="FULL" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW1__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
    </module>
    <module name="HEFC" caption="Harden Embedded Flash Controller" id="44123" version="A">
      <register-group name="HEFC">
        <register caption="HEFC Flash Mode Register" name="HEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Power Status Interrupt Enable" mask="0x00000002" name="FPSI"/>
          <bitfield caption="Must be written to 1" mask="0x00010000" name="ONE"/>
        </register>
        <register caption="HEFC Flash Command Register" name="HEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="HEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="HEFC_FCR__FKEY"/>
        </register>
        <register caption="HEFC Flash Status Register" name="HEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing HEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Write Register Error Status (cleared on read)" mask="0x00000010" name="WREER"/>
        </register>
        <register caption="HEFC Flash Result Register" name="HEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="HEFC Flash Power Management Register" name="HEFC_FPMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Power switch enable" mask="0x00000001" name="PWS_EN"/>
          <bitfield caption="Power switch Status" mask="0x00000002" name="PWS_STAT"/>
          <bitfield caption="Power switch Delay" mask="0x0000000C" name="PWS_DLY" values="HEFC_FPMR__PWS_DLY"/>
          <bitfield caption="Variation Factor" mask="0x00003F00" name="VAR_FACTOR"/>
          <bitfield caption="Flash insulated Control Status" mask="0x00010000" name="FUNC_ISOL_CTRL_N"/>
        </register>
        <register caption="Write Protection Mode Register" name="HEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="GPNVM Bit Write Protection" mask="0x00000002" name="GPNVMWP"/>
          <bitfield caption="Lock Bit Write Protection" mask="0x00000004" name="LOCKWP"/>
          <bitfield caption="Page, Sector and Plane Write Protection" mask="0x00000008" name="ERASEWP"/>
          <bitfield caption="User Signature Write Protection" mask="0x00000010" name="USER"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HEFC_WPMR__WPKEY"/>
        </register>
