Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 0" name="HEFC_HECC_CR0" offset="0x100" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 1" name="HEFC_HECC_CR1" offset="0x104" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 2" name="HEFC_HECC_CR2" offset="0x108" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 3" name="HEFC_HECC_CR3" offset="0x10C" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 4" name="HEFC_HECC_CR4" offset="0x110" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 5" name="HEFC_HECC_CR5" offset="0x114" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 6" name="HEFC_HECC_CR6" offset="0x118" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 7" name="HEFC_HECC_CR7" offset="0x11C" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
