Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 3" name="HEFC_HECC_TESTCB3" offset="0x14C" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 4" name="HEFC_HECC_TESTCB4" offset="0x150" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 5" name="HEFC_HECC_TESTCB5" offset="0x154" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 6" name="HEFC_HECC_TESTCB6" offset="0x158" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 7" name="HEFC_HECC_TESTCB7" offset="0x15C" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 8" name="HEFC_HECC_TESTCB8" offset="0x160" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 9" name="HEFC_HECC_TESTCB9" offset="0x164" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 10" name="HEFC_HECC_TESTCB10" offset="0x168" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 11" name="HEFC_HECC_TESTCB11" offset="0x16C" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 12" name="HEFC_HECC_TESTCB12" offset="0x170" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 13" name="HEFC_HECC_TESTCB13" offset="0x174" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 14" name="HEFC_HECC_TESTCB14" offset="0x178" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 15" name="HEFC_HECC_TESTCB15" offset="0x17C" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Status register" name="HEFC_HECC_SR" offset="0x180" rw="R" size="4">
          <bitfield caption="Fixable error status" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status" mask="0x00000100" name="MEM_NOFIX"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="write or read access" mask="0x08000000" name="TYPE"/>
          <bitfield caption="memory identification number" mask="0x30000000" name="MEM_ID"/>
        </register>
        <register caption="HECC Interrupt Enable Register" name="HEFC_HECC_IER" offset="0x184" rw="W" size="4">
          <bitfield caption="Fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="Un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Disable Register" name="HEFC_HECC_IDR" offset="0x188" rw="W" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Mask Register" name="HEFC_HECC_IMR" offset="0x18C" rw="R" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Fail address register" name="HEFC_HECC_FAILAR" offset="0x190" rw="R" size="4">
          <bitfield caption="address of the error detected" mask="0xFFFFFFFF" name="ADDRESS"/>
        </register>
      </register-group>
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="HEFC GPNVM word miscellaneous" name="HEFC_GPNVM_MISC" offset="0x0" rw="RW" size="4">
          <bitfield caption="Debug interface Selection" mask="0x00000002" name="DEBUG_INTF" values="HEFC_GPNVM_MISC__DEBUG_INTF"/>
          <bitfield caption="PFD Trim value" mask="0x00000700" name="PFD_TRIM"/>
        </register>
        <register caption="HEFC GPNVM word RC trim (1..3)" name="HEFC_GPNVM_RC_TRIM" offset="0x4" rw="RW" size="4" count="3">
          <bitfield caption="RC Temperature Trim" mask="0x00000003" name="RC_TTRIM"/>
          <bitfield caption="RC2 Temperature Trim" mask="0x0000000C" name="RC2_TTRIM"/>
          <bitfield caption="RC Frequency Trim 4MHz" mask="0x00000070" name="RC_FTRIM_4MHZ"/>
          <bitfield caption="RC Frequency Trim 8MHz" mask="0x00000380" name="RC_FTRIM_8MHZ"/>
          <bitfield caption="RC Frequency Trim 10MHz" mask="0x00001C00" name="RC_FTRIM_10MHZ"/>
          <bitfield caption="RC Frequency Trim 12MHz" mask="0x0000E000" name="RC_FTRIM_12MHZ"/>
          <bitfield caption="RC2 Frequency Trim 4MHz" mask="0x00070000" name="RC2_FTRIM_4MHZ"/>
          <bitfield caption="RC2 Frequency Trim 8MHz" mask="0x00380000" name="RC2_FTRIM_8MHZ"/>
          <bitfield caption="RC2 Frequency Trim 10MHz" mask="0x01C00000" name="RC2_FTRIM_10MHZ"/>
          <bitfield caption="RC2 Frequency Trim 12MHz" mask="0x0E000000" name="RC2_FTRIM_12MHZ"/>
        </register>
      </register-group>
