Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="HSMC Cycle Register (CS_number = 5)" name="HSMC_CYCLE5" offset="0x58" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="HSMC Mode Register (CS_number = 5)" name="HSMC_MODE5" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="Read-Modify Write enable" mask="0x00000004" name="RMW_ENABLE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="HSMC_MODE5__EXNW_MODE"/>
          <bitfield caption="Data Bus Width" mask="0x00000300" name="DBW" values="HSMC_MODE5__DBW"/>
        </register>
        <register caption="HSMC Write Protection Mode Register" name="HSMC_WPMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HSMC_WPMR__WPKEY"/>
        </register>
        <register caption="HSMC Write Protection Status Register" name="HSMC_WPSR" offset="0x0074" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="HSMC_MODE0__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE0__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0x0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="0x1"/>
        <value caption="32-bit Data Bus" name="_32_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE1__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE1__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0x0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="0x1"/>
        <value caption="32-bit Data Bus" name="_32_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE2__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE2__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0x0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="0x1"/>
        <value caption="32-bit Data Bus" name="_32_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE3__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE3__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0x0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="0x1"/>
        <value caption="32-bit Data Bus" name="_32_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE4__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE4__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0x0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="0x1"/>
        <value caption="32-bit Data Bus" name="_32_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMC_MODE5__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
