Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Tx Buffer Status Register" name="IP1553_TXBSR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Transmit buffer 0, x with x=[0-31]" mask="0x00000001" name="TF0"/>
          <bitfield caption="Transmit buffer 1, x with x=[0-31]" mask="0x00000002" name="TF1"/>
          <bitfield caption="Transmit buffer 2, x with x=[0-31]" mask="0x00000004" name="TF2"/>
          <bitfield caption="Transmit buffer 3, x with x=[0-31]" mask="0x00000008" name="TF3"/>
          <bitfield caption="Transmit buffer 4, x with x=[0-31]" mask="0x00000010" name="TF4"/>
          <bitfield caption="Transmit buffer 5, x with x=[0-31]" mask="0x00000020" name="TF5"/>
          <bitfield caption="Transmit buffer 6, x with x=[0-31]" mask="0x00000040" name="TF6"/>
          <bitfield caption="Transmit buffer 7, x with x=[0-31]" mask="0x00000080" name="TF7"/>
          <bitfield caption="Transmit buffer 8, x with x=[0-31]" mask="0x00000100" name="TF8"/>
          <bitfield caption="Transmit buffer 9, x with x=[0-31]" mask="0x00000200" name="TF9"/>
          <bitfield caption="Transmit buffer 10, x with x=[0-31]" mask="0x00000400" name="TF10"/>
          <bitfield caption="Transmit buffer 11, x with x=[0-31]" mask="0x00000800" name="TF11"/>
          <bitfield caption="Transmit buffer 12, x with x=[0-31]" mask="0x00001000" name="TF12"/>
          <bitfield caption="Transmit buffer 13, x with x=[0-31]" mask="0x00002000" name="TF13"/>
          <bitfield caption="Transmit buffer 14, x with x=[0-31]" mask="0x00004000" name="TF14"/>
          <bitfield caption="Transmit buffer 15, x with x=[0-31]" mask="0x00008000" name="TF15"/>
          <bitfield caption="Transmit buffer 16, x with x=[0-31]" mask="0x00010000" name="TF16"/>
          <bitfield caption="Transmit buffer 17, x with x=[0-31]" mask="0x00020000" name="TF17"/>
          <bitfield caption="Transmit buffer 18, x with x=[0-31]" mask="0x00040000" name="TF18"/>
          <bitfield caption="Transmit buffer 19, x with x=[0-31]" mask="0x00080000" name="TF19"/>
          <bitfield caption="Transmit buffer 20, x with x=[0-31]" mask="0x00100000" name="TF20"/>
          <bitfield caption="Transmit buffer 21, x with x=[0-31]" mask="0x00200000" name="TF21"/>
          <bitfield caption="Transmit buffer 22, x with x=[0-31]" mask="0x00400000" name="TF22"/>
          <bitfield caption="Transmit buffer 23, x with x=[0-31]" mask="0x00800000" name="TF23"/>
          <bitfield caption="Transmit buffer 24, x with x=[0-31]" mask="0x01000000" name="TF24"/>
          <bitfield caption="Transmit buffer 25, x with x=[0-31]" mask="0x02000000" name="TF25"/>
          <bitfield caption="Transmit buffer 26, x with x=[0-31]" mask="0x04000000" name="TF26"/>
          <bitfield caption="Transmit buffer 27, x with x=[0-31]" mask="0x08000000" name="TF27"/>
          <bitfield caption="Transmit buffer 28, x with x=[0-31]" mask="0x10000000" name="TF28"/>
          <bitfield caption="Transmit buffer 29, x with x=[0-31]" mask="0x20000000" name="TF29"/>
          <bitfield caption="Transmit buffer 30, x with x=[0-31]" mask="0x40000000" name="TF30"/>
          <bitfield caption="Transmit buffer 31, x with x=[0-31]" mask="0x80000000" name="TF31"/>
        </register>
        <register caption="Tx Buffer Access Error Register" name="IP1553_TXBAER" offset="0x50" rw="RW" size="4">
          <bitfield caption="Transmit error 0, x with x=[0-31]" mask="0x00000001" name="TER0"/>
          <bitfield caption="Transmit error 1, x with x=[0-31]" mask="0x00000002" name="TER1"/>
          <bitfield caption="Transmit error 2, x with x=[0-31]" mask="0x00000004" name="TER2"/>
          <bitfield caption="Transmit error 3, x with x=[0-31]" mask="0x00000008" name="TER3"/>
          <bitfield caption="Transmit error 4, x with x=[0-31]" mask="0x00000010" name="TER4"/>
          <bitfield caption="Transmit error 5, x with x=[0-31]" mask="0x00000020" name="TER5"/>
          <bitfield caption="Transmit error 6, x with x=[0-31]" mask="0x00000040" name="TER6"/>
          <bitfield caption="Transmit error 7, x with x=[0-31]" mask="0x00000080" name="TER7"/>
          <bitfield caption="Transmit error 8, x with x=[0-31]" mask="0x00000100" name="TER8"/>
          <bitfield caption="Transmit error 9, x with x=[0-31]" mask="0x00000200" name="TER9"/>
          <bitfield caption="Transmit error 10, x with x=[0-31]" mask="0x00000400" name="TER10"/>
          <bitfield caption="Transmit error 11, x with x=[0-31]" mask="0x00000800" name="TER11"/>
          <bitfield caption="Transmit error 12, x with x=[0-31]" mask="0x00001000" name="TER12"/>
          <bitfield caption="Transmit error 13, x with x=[0-31]" mask="0x00002000" name="TER13"/>
          <bitfield caption="Transmit error 14, x with x=[0-31]" mask="0x00004000" name="TER14"/>
          <bitfield caption="Transmit error 15, x with x=[0-31]" mask="0x00008000" name="TER15"/>
          <bitfield caption="Transmit error 16, x with x=[0-31]" mask="0x00010000" name="TER16"/>
          <bitfield caption="Transmit error 17, x with x=[0-31]" mask="0x00020000" name="TER17"/>
          <bitfield caption="Transmit error 18, x with x=[0-31]" mask="0x00040000" name="TER18"/>
          <bitfield caption="Transmit error 19, x with x=[0-31]" mask="0x00080000" name="TER19"/>
          <bitfield caption="Transmit error 20, x with x=[0-31]" mask="0x00100000" name="TER20"/>
          <bitfield caption="Transmit error 21, x with x=[0-31]" mask="0x00200000" name="TER21"/>
          <bitfield caption="Transmit error 22, x with x=[0-31]" mask="0x00400000" name="TER22"/>
          <bitfield caption="Transmit error 23, x with x=[0-31]" mask="0x00800000" name="TER23"/>
          <bitfield caption="Transmit error 24, x with x=[0-31]" mask="0x01000000" name="TER24"/>
          <bitfield caption="Transmit error 25, x with x=[0-31]" mask="0x02000000" name="TER25"/>
          <bitfield caption="Transmit error 26, x with x=[0-31]" mask="0x04000000" name="TER26"/>
          <bitfield caption="Transmit error 27, x with x=[0-31]" mask="0x08000000" name="TER27"/>
          <bitfield caption="Transmit error 28, x with x=[0-31]" mask="0x10000000" name="TER28"/>
          <bitfield caption="Transmit error 29, x with x=[0-31]" mask="0x20000000" name="TER29"/>
          <bitfield caption="Transmit error 30, x with x=[0-31]" mask="0x40000000" name="TER30"/>
          <bitfield caption="Transmit error 31, x with x=[0-31]" mask="0x80000000" name="TER31"/>
        </register>
      </register-group>
    </module>
    <module name="MATRIX" caption="AHB Bus Matrix" id="44138" version="A">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
