Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Master Error Status Register" name="MATRIX_MESR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master 0 Error Address Register 0" name="MATRIX_MEAR0" offset="0x160" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 1" name="MATRIX_MEAR1" offset="0x164" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 2" name="MATRIX_MEAR2" offset="0x168" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 3" name="MATRIX_MEAR3" offset="0x16C" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 4" name="MATRIX_MEAR4" offset="0x170" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 5" name="MATRIX_MEAR5" offset="0x174" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 6" name="MATRIX_MEAR6" offset="0x178" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 7" name="MATRIX_MEAR7" offset="0x17C" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 8" name="MATRIX_MEAR8" offset="0x180" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 9" name="MATRIX_MEAR9" offset="0x184" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 10" name="MATRIX_MEAR10" offset="0x188" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 11" name="MATRIX_MEAR11" offset="0x18C" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 12" name="MATRIX_MEAR12" offset="0x190" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 13" name="MATRIX_MEAR13" offset="0x194" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 14" name="MATRIX_MEAR14" offset="0x198" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Master 0 Error Address Register 15" name="MATRIX_MEAR15" offset="0x19C" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Write Protect Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield mask="0x00000080" name="CFGFRZ"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Protection Slave 0 Register 0" name="MATRIX_PSR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 1" name="MATRIX_PSR1" offset="0x204" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 2" name="MATRIX_PSR2" offset="0x208" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 3" name="MATRIX_PSR3" offset="0x20C" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
