Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Protected Areas Split Slave 0 Register 1" name="MATRIX_PASSR1" offset="0x244" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 2" name="MATRIX_PASSR2" offset="0x248" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 3" name="MATRIX_PASSR3" offset="0x24C" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 4" name="MATRIX_PASSR4" offset="0x250" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 5" name="MATRIX_PASSR5" offset="0x254" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 6" name="MATRIX_PASSR6" offset="0x258" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
