Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Protected Areas Split Slave 0 Register 7" name="MATRIX_PASSR7" offset="0x25C" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 8" name="MATRIX_PASSR8" offset="0x260" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 9" name="MATRIX_PASSR9" offset="0x264" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 10" name="MATRIX_PASSR10" offset="0x268" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 11" name="MATRIX_PASSR11" offset="0x26C" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 12" name="MATRIX_PASSR12" offset="0x270" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 13" name="MATRIX_PASSR13" offset="0x274" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 14" name="MATRIX_PASSR14" offset="0x278" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register 15" name="MATRIX_PASSR15" offset="0x27C" rw="RW" size="4">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
