Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Protected Region Top Slave 0 Register 0" name="MATRIX_PRTSR0" offset="0x280" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 1" name="MATRIX_PRTSR1" offset="0x284" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 2" name="MATRIX_PRTSR2" offset="0x288" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 3" name="MATRIX_PRTSR3" offset="0x28C" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 4" name="MATRIX_PRTSR4" offset="0x290" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 5" name="MATRIX_PRTSR5" offset="0x294" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 6" name="MATRIX_PRTSR6" offset="0x298" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 7" name="MATRIX_PRTSR7" offset="0x29C" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
