Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Protected Region Top Slave 0 Register 15" name="MATRIX_PRTSR15" offset="0x2BC" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Peripheral Select 1 Register 0" name="MATRIX_PPSELR0" offset="0x2C0" rw="RW" size="4">
          <bitfield caption="User PSELy Peripheral" mask="0x00000001" name="USERP0"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000002" name="USERP1"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000004" name="USERP2"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000008" name="USERP3"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000010" name="USERP4"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000020" name="USERP5"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000040" name="USERP6"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000080" name="USERP7"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000100" name="USERP8"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000200" name="USERP9"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000400" name="USERP10"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000800" name="USERP11"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00001000" name="USERP12"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00002000" name="USERP13"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00004000" name="USERP14"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00008000" name="USERP15"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00010000" name="USERP16"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00020000" name="USERP17"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00040000" name="USERP18"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00080000" name="USERP19"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00100000" name="USERP20"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00200000" name="USERP21"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00400000" name="USERP22"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00800000" name="USERP23"/>
          <bitfield caption="User PSELy Peripheral" mask="0x01000000" name="USERP24"/>
          <bitfield caption="User PSELy Peripheral" mask="0x02000000" name="USERP25"/>
          <bitfield caption="User PSELy Peripheral" mask="0x04000000" name="USERP26"/>
          <bitfield caption="User PSELy Peripheral" mask="0x08000000" name="USERP27"/>
          <bitfield caption="User PSELy Peripheral" mask="0x10000000" name="USERP28"/>
          <bitfield caption="User PSELy Peripheral" mask="0x20000000" name="USERP29"/>
          <bitfield caption="User PSELy Peripheral" mask="0x40000000" name="USERP30"/>
          <bitfield caption="User PSELy Peripheral" mask="0x80000000" name="USERP31"/>
        </register>
        <register caption="Protected Peripheral Select 1 Register 1" name="MATRIX_PPSELR1" offset="0x2C4" rw="RW" size="4">
          <bitfield caption="User PSELy Peripheral" mask="0x00000001" name="USERP0"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000002" name="USERP1"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000004" name="USERP2"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000008" name="USERP3"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000010" name="USERP4"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000020" name="USERP5"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000040" name="USERP6"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000080" name="USERP7"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000100" name="USERP8"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000200" name="USERP9"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000400" name="USERP10"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000800" name="USERP11"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00001000" name="USERP12"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00002000" name="USERP13"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00004000" name="USERP14"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00008000" name="USERP15"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00010000" name="USERP16"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00020000" name="USERP17"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00040000" name="USERP18"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00080000" name="USERP19"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00100000" name="USERP20"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00200000" name="USERP21"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00400000" name="USERP22"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00800000" name="USERP23"/>
          <bitfield caption="User PSELy Peripheral" mask="0x01000000" name="USERP24"/>
          <bitfield caption="User PSELy Peripheral" mask="0x02000000" name="USERP25"/>
          <bitfield caption="User PSELy Peripheral" mask="0x04000000" name="USERP26"/>
          <bitfield caption="User PSELy Peripheral" mask="0x08000000" name="USERP27"/>
          <bitfield caption="User PSELy Peripheral" mask="0x10000000" name="USERP28"/>
          <bitfield caption="User PSELy Peripheral" mask="0x20000000" name="USERP29"/>
          <bitfield caption="User PSELy Peripheral" mask="0x40000000" name="USERP30"/>
          <bitfield caption="User PSELy Peripheral" mask="0x80000000" name="USERP31"/>
        </register>
        <register caption="Protected Peripheral Select 1 Register 2" name="MATRIX_PPSELR2" offset="0x2C8" rw="RW" size="4">
          <bitfield caption="User PSELy Peripheral" mask="0x00000001" name="USERP0"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000002" name="USERP1"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000004" name="USERP2"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000008" name="USERP3"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000010" name="USERP4"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000020" name="USERP5"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000040" name="USERP6"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000080" name="USERP7"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000100" name="USERP8"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000200" name="USERP9"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000400" name="USERP10"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000800" name="USERP11"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00001000" name="USERP12"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00002000" name="USERP13"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00004000" name="USERP14"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00008000" name="USERP15"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00010000" name="USERP16"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00020000" name="USERP17"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00040000" name="USERP18"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00080000" name="USERP19"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00100000" name="USERP20"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00200000" name="USERP21"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00400000" name="USERP22"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00800000" name="USERP23"/>
          <bitfield caption="User PSELy Peripheral" mask="0x01000000" name="USERP24"/>
          <bitfield caption="User PSELy Peripheral" mask="0x02000000" name="USERP25"/>
          <bitfield caption="User PSELy Peripheral" mask="0x04000000" name="USERP26"/>
          <bitfield caption="User PSELy Peripheral" mask="0x08000000" name="USERP27"/>
          <bitfield caption="User PSELy Peripheral" mask="0x10000000" name="USERP28"/>
          <bitfield caption="User PSELy Peripheral" mask="0x20000000" name="USERP29"/>
          <bitfield caption="User PSELy Peripheral" mask="0x40000000" name="USERP30"/>
          <bitfield caption="User PSELy Peripheral" mask="0x80000000" name="USERP31"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLIMITED" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4_BEAT" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8_BEAT" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16_BEAT" value="0x4"/>
        <value caption="32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32_BEAT" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64_BEAT" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving." name="_128_BEAT" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module name="MCAN" caption="Controller Area Network" id="11273" version="P">
      <register-group name="MCAN">
        <register caption="Core Release Register" name="MCAN_CREL" offset="0x00" rw="R" size="4">
          <bitfield caption="Timestamp Day" mask="0x000000FF" name="DAY"/>
          <bitfield caption="Timestamp Month" mask="0x0000FF00" name="MON"/>
          <bitfield caption="Timestamp Year" mask="0x000F0000" name="YEAR"/>
          <bitfield caption="Sub-step of Core Release" mask="0x00F00000" name="SUBSTEP"/>
          <bitfield caption="Step of Core Release" mask="0x0F000000" name="STEP"/>
          <bitfield caption="Core Release" mask="0xF0000000" name="REL"/>
        </register>
        <register caption="Endian Register" name="MCAN_ENDN" offset="0x04" rw="R" size="4">
          <bitfield caption="Endianness Test Value" mask="0xFFFFFFFF" name="ETV"/>
        </register>
        <register caption="Customer Register" name="MCAN_CUST" offset="0x08" rw="RW" size="4">
          <bitfield caption="Customer-specific Value" mask="0xFFFFFFFF" name="CSV"/>
        </register>
        <register caption="Data Bit Timing and Prescaler Register" name="MCAN_DBTP" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Data (Re) Synchronization Jump Width" mask="0x00000007" name="DSJW"/>
          <bitfield caption="Data Time Segment After Sample Point" mask="0x000000F0" name="DTSEG2"/>
          <bitfield caption="Data Time Segment Before Sample Point" mask="0x00001F00" name="DTSEG1"/>
          <bitfield caption="Data Bit Rate Prescaler" mask="0x001F0000" name="DBRP"/>
          <bitfield caption="Transmitter Delay Compensation" mask="0x00800000" name="TDC" values="MCAN_DBTP__TDC"/>
        </register>
        <register caption="Test Register" name="MCAN_TEST" offset="0x10" rw="RW" size="4">
          <bitfield caption="Loop Back Mode (read/write)" mask="0x00000010" name="LBCK" values="MCAN_TEST__LBCK"/>
          <bitfield caption="Control of Transmit Pin (read/write)" mask="0x00000060" name="TX" values="MCAN_TEST__TX"/>
          <bitfield caption="Receive Pin (read-only)" mask="0x00000080" name="RX"/>
        </register>
        <register caption="RAM Watchdog Register" name="MCAN_RWD" offset="0x14" rw="RW" size="4">
          <bitfield caption="Watchdog Configuration (read/write)" mask="0x000000FF" name="WDC"/>
          <bitfield caption="Watchdog Value (read-only)" mask="0x0000FF00" name="WDV"/>
        </register>
