Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
      <value-group caption="Event Type" name="MCAN_TXEFE_1__ET">
        <value caption="Tx event" name="TXE" value="1"/>
        <value caption="Transmission in spite of cancellation" name="TXC" value="2"/>
      </value-group>
      <value-group caption="Standard Filter Element Configuration" name="MCAN_SIDFE_0__SFEC">
        <value caption="Disable filter element" name="DISABLE" value="0"/>
        <value caption="Store in Rx FIFO 0 if filter matches" name="STF0M" value="1"/>
        <value caption="Store in Rx FIFO 1 if filter matches" name="STF1M" value="2"/>
        <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
        <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
        <value caption="Set priority and store in FIFO 0 if filter matches" name="PRIF0M" value="5"/>
        <value caption="Set priority and store in FIFO 1 if filter matches" name="PRIF1M" value="6"/>
        <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
      </value-group>
      <value-group caption="Standard Filter Type" name="MCAN_SIDFE_0__SFT">
        <value caption="Range filter from SFID1 to SFID2" name="RANGE" value="0"/>
        <value caption="Dual ID filter for SF1ID or SF2ID" name="DUAL" value="1"/>
        <value caption="Classic filter" name="CLASSIC" value="2"/>
      </value-group>
      <value-group caption="Extended Filter Element Configuration" name="MCAN_XIDFE_0__EFEC">
        <value caption="Disable filter element" name="DISABLE" value="0"/>
        <value caption="Store in Rx FIFO 0 if filter matches" name="STF0M" value="1"/>
        <value caption="Store in Rx FIFO 1 if filter matches" name="STF1M" value="2"/>
        <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
        <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
        <value caption="Set priority and store in FIFO 0 if filter matches" name="PRIF0M" value="5"/>
        <value caption="Set priority and store in FIFO 1 if filter matches" name="PRIF1M" value="6"/>
        <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
      </value-group>
      <value-group caption="Extended Filter Type" name="MCAN_XIDFE_1__EFT">
        <value caption="Range filter from EFID1 to EFID2" name="RANGE" value="0"/>
        <value caption="Dual ID filter for EFID1 or EFID2" name="DUAL" value="1"/>
        <value caption="Classic filter" name="CLASSIC" value="2"/>
        <value caption="Range filter from EFID1 to EFID2 with no XIDAM mask" name="RANGE_NO_XIDAM" value="3"/>
      </value-group>
    </module>
    <module name="NMIC" caption="Non-maskable Interrupt Controller" id="44062" version="A">
      <register-group name="NMIC">
        <register caption="Interrupt Enable Register" name="NMIC_IER" offset="0x00" rw="W" size="4">
          <bitfield caption="Non-maskable Interrupt 0 Enable" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Non-maskable Interrupt 1 Enable" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Non-maskable Interrupt 2 Enable" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Non-maskable Interrupt 3 Enable" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Non-maskable Interrupt 4 Enable" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Non-maskable Interrupt 5 Enable" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Non-maskable Interrupt 6 Enable" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Non-maskable Interrupt 7 Enable" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Non-maskable Interrupt 8 Enable" mask="0x00000100" name="NMI8"/>
        </register>
        <register caption="Interrupt Disable Register" name="NMIC_IDR" offset="0x04" rw="W" size="4">
          <bitfield caption="Non-maskable Interrupt 0 Disable" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Non-maskable Interrupt 1 Disable" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Non-maskable Interrupt 2 Disable" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Non-maskable Interrupt 3 Disable" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Non-maskable Interrupt 4 Disable" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Non-maskable Interrupt 5 Disable" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Non-maskable Interrupt 6 Disable" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Non-maskable Interrupt 7 Disable" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Non-maskable Interrupt 8 Disable" mask="0x00000100" name="NMI8"/>
        </register>
        <register caption="Interrupt Active Register" name="NMIC_IAR" offset="0x08" rw="R" size="4">
          <bitfield caption="Active Interrupt 0" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Active Interrupt 1" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Active Interrupt 2" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Active Interrupt 3" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Active Interrupt 4" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Active Interrupt 5" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Active Interrupt 6" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Active Interrupt 7" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Active Interrupt 8" mask="0x00000100" name="NMI8"/>
        </register>
        <register caption="Interrupt Status Register" name="NMIC_ISR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Non-maskable Interrupt Source 0 Pending (cleared on read)" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Non-maskable Interrupt Source 1 Pending (cleared on read)" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Non-maskable Interrupt Source 2 Pending (cleared on read)" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Non-maskable Interrupt Source 3 Pending (cleared on read)" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Non-maskable Interrupt Source 4 Pending (cleared on read)" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Non-maskable Interrupt Source 5 Pending (cleared on read)" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Non-maskable Interrupt Source 6 Pending (cleared on read)" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Non-maskable Interrupt Source 7 Pending (cleared on read)" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Non-maskable Interrupt Source 8 Pending (cleared on read)" mask="0x00000100" name="NMI8"/>
          <bitfield caption="Non-maskable Interrupt Source 9 Pending (cleared on read)" mask="0x00000200" name="NMI9"/>
          <bitfield caption="Non-maskable Interrupt Source 10 Pending (cleared on read)" mask="0x00000400" name="NMI10"/>
          <bitfield caption="Non-maskable Interrupt Source 11 Pending (cleared on read)" mask="0x00000800" name="NMI11"/>
          <bitfield caption="Non-maskable Interrupt Source 12 Pending (cleared on read)" mask="0x00001000" name="NMI12"/>
          <bitfield caption="Non-maskable Interrupt Source 13 Pending (cleared on read)" mask="0x00002000" name="NMI13"/>
          <bitfield caption="Non-maskable Interrupt Source 14 Pending (cleared on read)" mask="0x00004000" name="NMI14"/>
          <bitfield caption="Non-maskable Interrupt Source 15 Pending (cleared on read)" mask="0x00008000" name="NMI15"/>
        </register>
        <register caption="Glitch Filter Configuration Status Register" name="NMIC_GFCS" offset="0x10" rw="R" size="4">
          <bitfield caption="Filter 0 Configuration Ready" mask="0x00000001" name="RDY0"/>
          <bitfield caption="Filter 1 Configuration Ready" mask="0x00000002" name="RDY1"/>
          <bitfield caption="Filter 2 Configuration Ready" mask="0x00000004" name="RDY2"/>
          <bitfield caption="Filter 3 Configuration Ready" mask="0x00000008" name="RDY3"/>
          <bitfield caption="Filter 4 Configuration Ready" mask="0x00000010" name="RDY4"/>
          <bitfield caption="Filter 5 Configuration Ready" mask="0x00000020" name="RDY5"/>
          <bitfield caption="Filter 6 Configuration Ready" mask="0x00000040" name="RDY6"/>
          <bitfield caption="Filter 7 Configuration Ready" mask="0x00000080" name="RDY7"/>
          <bitfield caption="Filter 8 Configuration Ready" mask="0x00000100" name="RDY8"/>
          <bitfield caption="Filter 9 Configuration Ready" mask="0x00000200" name="RDY9"/>
          <bitfield caption="Filter 10 Configuration Ready" mask="0x00000400" name="RDY10"/>
          <bitfield caption="Filter 11 Configuration Ready" mask="0x00000800" name="RDY11"/>
          <bitfield caption="Filter 12 Configuration Ready" mask="0x00001000" name="RDY12"/>
          <bitfield caption="Filter 13 Configuration Ready" mask="0x00002000" name="RDY13"/>
          <bitfield caption="Filter 14 Configuration Ready" mask="0x00004000" name="RDY14"/>
          <bitfield caption="Filter 15 Configuration Ready" mask="0x00008000" name="RDY15"/>
        </register>
