Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="PLL Configuration Register" name="PMC_PLL_CFG" offset="0x0080" rw="RW" size="4">
          <bitfield caption="PLLA Output Current" mask="0x0000000F" name="OUTCUR_PLLA" values="PMC_PLL_CFG__OUTCUR_PLLA"/>
          <bitfield caption="Internal Filter PLL - Select Internal Capaticance Value" mask="0x00003000" name="SCA" values="PMC_PLL_CFG__SCA"/>
          <bitfield caption="Internal Filter PLL - Select Internal Resistor Value" mask="0x0000C000" name="SRA" values="PMC_PLL_CFG__SRA"/>
          <bitfield caption="PLLB Output Current" mask="0x000F0000" name="OUTCUR_PLLB" values="PMC_PLL_CFG__OUTCUR_PLLB"/>
          <bitfield caption="Internal Filter PLL - Select Internal Capaticance Value" mask="0x30000000" name="SCB" values="PMC_PLL_CFG__SCB"/>
          <bitfield caption="Internal Filter PLL - Select Internal Resistor Value" mask="0xC0000000" name="SRB" values="PMC_PLL_CFG__SRB"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x010C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000007F" name="PID"/>
          <bitfield caption="Generic Clock Source Selection" mask="0x00000700" name="GCLKCSS" values="PMC_PCR__GCLKCSS"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Generic Clock Division Ratio" mask="0x0FF00000" name="GCLKDIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
          <bitfield caption="Generic Clock Enable" mask="0x20000000" name="GCLKEN"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR1" offset="0x0110" rw="RW" size="4">
          <bitfield caption="Main RC Oscillator Calibration Bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 10 MHz" mask="0x007F0000" name="CAL10"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 10 MHz" mask="0x00800000" name="SEL10"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 12 MHz" mask="0x7F000000" name="CAL12"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 12 MHz" mask="0x80000000" name="SEL12"/>
        </register>
        <register caption="PLL Maximum Multiplier Value Register" name="PMC_PMMR" offset="0x0130" rw="RW" size="4">
          <bitfield caption="PLLA Maximum Allowed Multiplier Value" mask="0x000007FF" name="PLLA_MMAX"/>
          <bitfield caption="PLLB Maximum Allowed Multiplier Value" mask="0x07FF0000" name="PLLB_MMAX"/>
        </register>
        <register caption="CPU Monitor Limits Register" name="PMC_CPULIM" offset="0x0160" rw="RW" size="4">
          <bitfield caption="CPU Monitoring Low IT Limit" mask="0x000000FF" name="CPU_LOW_IT"/>
          <bitfield caption="CPU Monitoring High IT Limit" mask="0x0000FF00" name="CPU_HIGH_IT"/>
          <bitfield caption="CPU Monitoring Low RESET Limit" mask="0x00FF0000" name="CPU_LOW_RES"/>
          <bitfield caption="CPU Monitoring High Reset Limit" mask="0xFF000000" name="CPU_HIGH_RES"/>
        </register>
        <register caption="Peripheral Clock Status Register 0" name="PMC_CSR0" offset="0x0170" rw="R" size="4">
          <bitfield caption="Peripheral Clock 0 Status" mask="0x00000001" name="PID0"/>
          <bitfield caption="Peripheral Clock 1 Status" mask="0x00000002" name="PID1"/>
          <bitfield caption="Peripheral Clock 2 Status" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Status" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Status" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Status" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Status" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Status" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 22 Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_CSR1" offset="0x0174" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Status" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Status" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 52 Status" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral Clock 53 Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 54 Status" mask="0x00400000" name="PID54"/>
          <bitfield caption="Peripheral Clock 55 Status" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 56 Status" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Status" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Status" mask="0x10000000" name="PID60"/>
          <bitfield caption="Peripheral Clock 61 Status" mask="0x20000000" name="PID61"/>
          <bitfield caption="Peripheral Clock 62 Status" mask="0x40000000" name="PID62"/>
          <bitfield caption="Peripheral Clock 63 Status" mask="0x80000000" name="PID63"/>
        </register>
        <register caption="Peripheral Clock Status Register 2" name="PMC_CSR2" offset="0x0178" rw="R" size="4">
          <bitfield caption="Peripheral Clock 64 Status" mask="0x00000001" name="PID64"/>
          <bitfield caption="Peripheral Clock 65 Status" mask="0x00000002" name="PID65"/>
          <bitfield caption="Peripheral Clock 66 Status" mask="0x00000004" name="PID66"/>
          <bitfield caption="Peripheral Clock 67 Status" mask="0x00000008" name="PID67"/>
          <bitfield caption="Peripheral Clock 68 Status" mask="0x00000010" name="PID68"/>
          <bitfield caption="Peripheral Clock 69 Status" mask="0x00000020" name="PID69"/>
          <bitfield caption="Peripheral Clock 70 Status" mask="0x00000040" name="PID70"/>
          <bitfield caption="Peripheral Clock 71 Status" mask="0x00000080" name="PID71"/>
          <bitfield caption="Peripheral Clock 72 Status" mask="0x00000100" name="PID72"/>
          <bitfield caption="Peripheral Clock 73 Status" mask="0x00000200" name="PID73"/>
          <bitfield caption="Peripheral Clock 74 Status" mask="0x00000400" name="PID74"/>
          <bitfield caption="Peripheral Clock 75 Status" mask="0x00000800" name="PID75"/>
          <bitfield caption="Peripheral Clock 76 Status" mask="0x00001000" name="PID76"/>
          <bitfield caption="Peripheral Clock 77 Status" mask="0x00002000" name="PID77"/>
          <bitfield caption="Peripheral Clock 78 Status" mask="0x00004000" name="PID78"/>
          <bitfield caption="Peripheral Clock 79 Status" mask="0x00008000" name="PID79"/>
          <bitfield caption="Peripheral Clock 80 Status" mask="0x00010000" name="PID80"/>
          <bitfield caption="Peripheral Clock 81 Status" mask="0x00020000" name="PID81"/>
          <bitfield caption="Peripheral Clock 82 Status" mask="0x00040000" name="PID82"/>
          <bitfield caption="Peripheral Clock 83 Status" mask="0x00080000" name="PID83"/>
          <bitfield caption="Peripheral Clock 84 Status" mask="0x00100000" name="PID84"/>
          <bitfield caption="Peripheral Clock 85 Status" mask="0x00200000" name="PID85"/>
          <bitfield caption="Peripheral Clock 86 Status" mask="0x00400000" name="PID86"/>
          <bitfield caption="Peripheral Clock 87 Status" mask="0x00800000" name="PID87"/>
          <bitfield caption="Peripheral Clock 88 Status" mask="0x01000000" name="PID88"/>
          <bitfield caption="Peripheral Clock 89 Status" mask="0x02000000" name="PID89"/>
          <bitfield caption="Peripheral Clock 90 Status" mask="0x04000000" name="PID90"/>
          <bitfield caption="Peripheral Clock 91 Status" mask="0x08000000" name="PID91"/>
          <bitfield caption="Peripheral Clock 92 Status" mask="0x10000000" name="PID92"/>
          <bitfield caption="Peripheral Clock 93 Status" mask="0x20000000" name="PID93"/>
          <bitfield caption="Peripheral Clock 94 Status" mask="0x40000000" name="PID94"/>
          <bitfield caption="Peripheral Clock 95 Status" mask="0x80000000" name="PID95"/>
        </register>
        <register caption="Peripheral Clock Status Register 3" name="PMC_CSR3" offset="0x017C" rw="R" size="4">
          <bitfield caption="Peripheral Clock 96 Status" mask="0x00000001" name="PID96"/>
          <bitfield caption="Peripheral Clock 97 Status" mask="0x00000002" name="PID97"/>
          <bitfield caption="Peripheral Clock 98 Status" mask="0x00000004" name="PID98"/>
          <bitfield caption="Peripheral Clock 99 Status" mask="0x00000008" name="PID99"/>
          <bitfield caption="Peripheral Clock 100 Status" mask="0x00000010" name="PID100"/>
          <bitfield caption="Peripheral Clock 101 Status" mask="0x00000020" name="PID101"/>
          <bitfield caption="Peripheral Clock 102 Status" mask="0x00000040" name="PID102"/>
          <bitfield caption="Peripheral Clock 103 Status" mask="0x00000080" name="PID103"/>
          <bitfield caption="Peripheral Clock 104 Status" mask="0x00000100" name="PID104"/>
          <bitfield caption="Peripheral Clock 105 Status" mask="0x00000200" name="PID105"/>
          <bitfield caption="Peripheral Clock 106 Status" mask="0x00000400" name="PID106"/>
          <bitfield caption="Peripheral Clock 107 Status" mask="0x00000800" name="PID107"/>
          <bitfield caption="Peripheral Clock 108 Status" mask="0x00001000" name="PID108"/>
          <bitfield caption="Peripheral Clock 109 Status" mask="0x00002000" name="PID109"/>
          <bitfield caption="Peripheral Clock 110 Status" mask="0x00004000" name="PID110"/>
          <bitfield caption="Peripheral Clock 111 Status" mask="0x00008000" name="PID111"/>
          <bitfield caption="Peripheral Clock 112 Status" mask="0x00010000" name="PID112"/>
          <bitfield caption="Peripheral Clock 113 Status" mask="0x00020000" name="PID113"/>
          <bitfield caption="Peripheral Clock 114 Status" mask="0x00040000" name="PID114"/>
          <bitfield caption="Peripheral Clock 115 Status" mask="0x00080000" name="PID115"/>
          <bitfield caption="Peripheral Clock 116 Status" mask="0x00100000" name="PID116"/>
          <bitfield caption="Peripheral Clock 117 Status" mask="0x00200000" name="PID117"/>
          <bitfield caption="Peripheral Clock 118 Status" mask="0x00400000" name="PID118"/>
          <bitfield caption="Peripheral Clock 119 Status" mask="0x00800000" name="PID119"/>
          <bitfield caption="Peripheral Clock 120 Status" mask="0x01000000" name="PID120"/>
          <bitfield caption="Peripheral Clock 121 Status" mask="0x02000000" name="PID121"/>
          <bitfield caption="Peripheral Clock 122 Status" mask="0x04000000" name="PID122"/>
          <bitfield caption="Peripheral Clock 123 Status" mask="0x08000000" name="PID123"/>
          <bitfield caption="Peripheral Clock 124 Status" mask="0x10000000" name="PID124"/>
          <bitfield caption="Peripheral Clock 125 Status" mask="0x20000000" name="PID125"/>
          <bitfield caption="Peripheral Clock 126 Status" mask="0x40000000" name="PID126"/>
          <bitfield caption="Peripheral Clock 127 Status" mask="0x80000000" name="PID127"/>
        </register>
        <register caption="Generic Clock Status Register 0" name="PMC_GCSR0" offset="0x0190" rw="R" size="4">
          <bitfield caption="Generic Clock 0 Status" mask="0x00000001" name="GPID0"/>
          <bitfield caption="Generic Clock 1 Status" mask="0x00000002" name="GPID1"/>
          <bitfield caption="Generic Clock 2 Status" mask="0x00000004" name="GPID2"/>
          <bitfield caption="Generic Clock 3 Status" mask="0x00000008" name="GPID3"/>
          <bitfield caption="Generic Clock 4 Status" mask="0x00000010" name="GPID4"/>
          <bitfield caption="Generic Clock 5 Status" mask="0x00000020" name="GPID5"/>
          <bitfield caption="Generic Clock 6 Status" mask="0x00000040" name="GPID6"/>
          <bitfield caption="Generic Clock 7 Status" mask="0x00000080" name="GPID7"/>
          <bitfield caption="Generic Clock 8 Status" mask="0x00000100" name="GPID8"/>
          <bitfield caption="Generic Clock 9 Status" mask="0x00000200" name="GPID9"/>
          <bitfield caption="Generic Clock 10 Status" mask="0x00000400" name="GPID10"/>
          <bitfield caption="Generic Clock 11 Status" mask="0x00000800" name="GPID11"/>
          <bitfield caption="Generic Clock 12 Status" mask="0x00001000" name="GPID12"/>
          <bitfield caption="Generic Clock 13 Status" mask="0x00002000" name="GPID13"/>
          <bitfield caption="Generic Clock 14 Status" mask="0x00004000" name="GPID14"/>
          <bitfield caption="Generic Clock 15 Status" mask="0x00008000" name="GPID15"/>
          <bitfield caption="Generic Clock 16 Status" mask="0x00010000" name="GPID16"/>
          <bitfield caption="Generic Clock 17 Status" mask="0x00020000" name="GPID17"/>
          <bitfield caption="Generic Clock 18 Status" mask="0x00040000" name="GPID18"/>
          <bitfield caption="Generic Clock 19 Status" mask="0x00080000" name="GPID19"/>
          <bitfield caption="Generic Clock 20 Status" mask="0x00100000" name="GPID20"/>
          <bitfield caption="Generic Clock 21 Status" mask="0x00200000" name="GPID21"/>
          <bitfield caption="Generic Clock 22 Status" mask="0x00400000" name="GPID22"/>
          <bitfield caption="Generic Clock 23 Status" mask="0x00800000" name="GPID23"/>
          <bitfield caption="Generic Clock 24 Status" mask="0x01000000" name="GPID24"/>
          <bitfield caption="Generic Clock 25 Status" mask="0x02000000" name="GPID25"/>
          <bitfield caption="Generic Clock 26 Status" mask="0x04000000" name="GPID26"/>
          <bitfield caption="Generic Clock 27 Status" mask="0x08000000" name="GPID27"/>
          <bitfield caption="Generic Clock 28 Status" mask="0x10000000" name="GPID28"/>
          <bitfield caption="Generic Clock 29 Status" mask="0x20000000" name="GPID29"/>
          <bitfield caption="Generic Clock 30 Status" mask="0x40000000" name="GPID30"/>
          <bitfield caption="Generic Clock 31 Status" mask="0x80000000" name="GPID31"/>
        </register>
        <register caption="Generic Clock Status Register 1" name="PMC_GCSR1" offset="0x0194" rw="R" size="4">
          <bitfield caption="Generic Clock 32 Status" mask="0x00000001" name="GPID32"/>
          <bitfield caption="Generic Clock 33 Status" mask="0x00000002" name="GPID33"/>
          <bitfield caption="Generic Clock 34 Status" mask="0x00000004" name="GPID34"/>
          <bitfield caption="Generic Clock 35 Status" mask="0x00000008" name="GPID35"/>
          <bitfield caption="Generic Clock 36 Status" mask="0x00000010" name="GPID36"/>
          <bitfield caption="Generic Clock 37 Status" mask="0x00000020" name="GPID37"/>
          <bitfield caption="Generic Clock 38 Status" mask="0x00000040" name="GPID38"/>
          <bitfield caption="Generic Clock 39 Status" mask="0x00000080" name="GPID39"/>
          <bitfield caption="Generic Clock 40 Status" mask="0x00000100" name="GPID40"/>
          <bitfield caption="Generic Clock 41 Status" mask="0x00000200" name="GPID41"/>
          <bitfield caption="Generic Clock 42 Status" mask="0x00000400" name="GPID42"/>
          <bitfield caption="Generic Clock 43 Status" mask="0x00000800" name="GPID43"/>
          <bitfield caption="Generic Clock 44 Status" mask="0x00001000" name="GPID44"/>
          <bitfield caption="Generic Clock 45 Status" mask="0x00002000" name="GPID45"/>
          <bitfield caption="Generic Clock 46 Status" mask="0x00004000" name="GPID46"/>
          <bitfield caption="Generic Clock 47 Status" mask="0x00008000" name="GPID47"/>
          <bitfield caption="Generic Clock 48 Status" mask="0x00010000" name="GPID48"/>
          <bitfield caption="Generic Clock 49 Status" mask="0x00020000" name="GPID49"/>
          <bitfield caption="Generic Clock 50 Status" mask="0x00040000" name="GPID50"/>
          <bitfield caption="Generic Clock 51 Status" mask="0x00080000" name="GPID51"/>
          <bitfield caption="Generic Clock 52 Status" mask="0x00100000" name="GPID52"/>
          <bitfield caption="Generic Clock 53 Status" mask="0x00200000" name="GPID53"/>
          <bitfield caption="Generic Clock 54 Status" mask="0x00400000" name="GPID54"/>
          <bitfield caption="Generic Clock 55 Status" mask="0x00800000" name="GPID55"/>
          <bitfield caption="Generic Clock 56 Status" mask="0x01000000" name="GPID56"/>
          <bitfield caption="Generic Clock 57 Status" mask="0x02000000" name="GPID57"/>
          <bitfield caption="Generic Clock 58 Status" mask="0x04000000" name="GPID58"/>
          <bitfield caption="Generic Clock 59 Status" mask="0x08000000" name="GPID59"/>
          <bitfield caption="Generic Clock 60 Status" mask="0x10000000" name="GPID60"/>
          <bitfield caption="Generic Clock 61 Status" mask="0x20000000" name="GPID61"/>
          <bitfield caption="Generic Clock 62 Status" mask="0x40000000" name="GPID62"/>
          <bitfield caption="Generic Clock 63 Status" mask="0x80000000" name="GPID63"/>
        </register>
