Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
      <value-group caption="" name="QSPI_IFR__OPTL">
        <value caption="The option code is 1 bit long." name="OPTION_1BIT" value="0x0"/>
        <value caption="The option code is 2 bits long." name="OPTION_2BIT" value="0x1"/>
        <value caption="The option code is 4 bits long." name="OPTION_4BIT" value="0x2"/>
        <value caption="The option code is 8 bits long." name="OPTION_8BIT" value="0x3"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__ADDRL">
        <value caption="The address is 24 bits long." name="_24_BIT" value="0"/>
        <value caption="The address is 32 bits long." name="_32_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__TFRTYP">
        <value caption="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible." name="TRSFR_READ" value="0x0"/>
        <value caption="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible." name="TRSFR_READ_MEMORY" value="0x1"/>
        <value caption="Write transfer into the serial memory.Scrambling is not performed." name="TRSFR_WRITE" value="0x2"/>
        <value caption="Write data transfer into the serial memory.If enabled, scrambling is performed." name="TRSFR_WRITE_MEMORY" value="0x3"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__CRM">
        <value caption="Continuous Read mode is disabled." name="DISABLED" value="0"/>
        <value caption="Continuous Read mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_SMR__SCREN">
        <value caption="The scrambling/unscrambling is disabled." name="DISABLED" value="0"/>
        <value caption="The scrambling/unscrambling is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__CSMODE">
        <value caption="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." name="NOT_RELOADED" value="0x0"/>
        <value caption="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred." name="LASTXFER" value="0x1"/>
        <value caption="The chip select is deasserted systematically after each transfer." name="SYSTEMATICALLY" value="0x2"/>
      </value-group>
      <value-group caption="" name="QSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x515350"/>
      </value-group>
    </module>
    <module name="RSTC" caption="Reset Controller" id="11009" version="N">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="External Reset" mask="0x00000010" name="PERIIDON"/>
          <bitfield caption="Peripheral Identifier" mask="0x0000FF00" name="PERIID"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="Slow Clock Switching" mask="0x00000002" name="SCKSW"/>
          <bitfield caption="CPU Fail Enable" mask="0x00000008" name="CPUFEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
      <value-group caption="" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="RSTC_SR__RSTTYP">
        <value caption="First powerup reset" name="GENERAL_RST" value="0x0"/>
        <value caption="Watchdog fault occurred" name="WDT_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
        <value caption="CPU clock failure detection occurred" name="CPU_FAIL_RST" value="0x6"/>
        <value caption="32.768 kHz crystal failure detection fault occurred" name="SLCK_XTAL_RST" value="0x7"/>
      </value-group>
      <value-group caption="" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module name="RTC" caption="Real-time Clock" id="6056" version="ZF">
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="RTCOUT0 OutputSource Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="PIO Line Enable" mask="0x00080000" name="EN0"/>
          <bitfield caption="RTCOUT1 Output Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="PIO Line Enable" mask="0x00800000" name="EN1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
