Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="Input/Output Data 0 Register 1" name="SHA_IODATAR1" offset="0x84" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 2" name="SHA_IODATAR2" offset="0x88" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 3" name="SHA_IODATAR3" offset="0x8C" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 4" name="SHA_IODATAR4" offset="0x90" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 5" name="SHA_IODATAR5" offset="0x94" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 6" name="SHA_IODATAR6" offset="0x98" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 7" name="SHA_IODATAR7" offset="0x9C" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 8" name="SHA_IODATAR8" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 9" name="SHA_IODATAR9" offset="0xA4" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 10" name="SHA_IODATAR10" offset="0xA8" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 11" name="SHA_IODATAR11" offset="0xAC" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 12" name="SHA_IODATAR12" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 13" name="SHA_IODATAR13" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 14" name="SHA_IODATAR14" offset="0xB8" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 15" name="SHA_IODATAR15" offset="0xBC" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="SHA_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SHA_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SHA_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SHA_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="SHA_IDATAR0 access only mode (mandatory when DMA is used)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="" name="SHA_MR__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA384 algorithm processed" name="SHA384" value="0x2"/>
        <value caption="SHA512 algorithm processed" name="SHA512" value="0x3"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
        <value caption="HMAC algorithm with SHA1 Hash processed" name="HMAC_SHA1" value="0x8"/>
        <value caption="HMAC algorithm with SHA256 Hash processed" name="HMAC_SHA256" value="0x9"/>
        <value caption="HMAC algorithm with SHA384 Hash processed" name="HMAC_SHA384" value="0xA"/>
        <value caption="HMAC algorithm with SHA512 Hash processed" name="HMAC_SHA512" value="0xB"/>
        <value caption="HMAC algorithm with SHA224 Hash processed" name="HMAC_SHA224" value="0xC"/>
      </value-group>
      <value-group caption="" name="SHA_MR__DUALBUFF">
        <value caption="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="" name="SHA_MR__CHECK">
        <value caption="No check is performed" name="NO_CHECK" value="0x0"/>
        <value caption="Check is performed with expected hash stored in internal expected hash value registers." name="CHECK_EHV" value="0x1"/>
        <value caption="Check is performed with expected hash provided after the message." name="CHECK_MESSAGE" value="0x2"/>
      </value-group>
