Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Set Mask" name="SPW_LINK1_DISTACKIM_S" offset="0x478" rw="W" size="4">
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Clear Mask" name="SPW_LINK1_DISTACKIM_C" offset="0x47C" rw="W" size="4">
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x80000000" name="DA31"/>
        </register>
