Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="SpW Link 2 Pending Read Masked Interrupt" name="SPW_LINK2_PI_RM" offset="0x480" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Pending Read and Clear Masked Interrupt" name="SPW_LINK2_PI_RCM" offset="0x484" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Pending Read Interrupt" name="SPW_LINK2_PI_R" offset="0x488" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Pending Read, Clear and Enabled Interrupt" name="SPW_LINK2_PI_RCS" offset="0x48C" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Interrupt Mask" name="SPW_LINK2_IM" offset="0x490" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Clear Pending Interrupt" name="SPW_LINK2_PI_C" offset="0x494" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Interrupt Set Mask" name="SPW_LINK2_IM_S" offset="0x498" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
