Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register caption="PktRx Interrupt Set Mask" name="SPW_PKTRX1_IM_S" offset="0x818" rw="W" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="EOP seen" mask="0x00000002" name="EOP"/>
          <bitfield caption="EEP seen" mask="0x00000004" name="EEP"/>
          <bitfield caption="Packet Discard" mask="0x00000008" name="DISCARD"/>
          <bitfield caption="Activated" mask="0x00000010" name="ACT"/>
        </register>
        <register caption="PktRx Interrupt Clear Mask" name="SPW_PKTRX1_IM_C" offset="0x81C" rw="W" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="EOP seen" mask="0x00000002" name="EOP"/>
          <bitfield caption="EEP seen" mask="0x00000004" name="EEP"/>
          <bitfield caption="Packet Discard" mask="0x00000008" name="DISCARD"/>
          <bitfield caption="Activated" mask="0x00000010" name="ACT"/>
        </register>
        <register caption="PktRx Config" name="SPW_PKTRX1_CFG" offset="0x820" rw="RW" size="4">
          <bitfield caption="Discard" mask="0x00000001" name="DISCARD"/>
        </register>
        <register caption="PktRx Status" name="SPW_PKTRX1_STATUS" offset="0x824" rw="R" size="4">
          <bitfield caption="Packet Count" mask="0x0000FFFF" name="COUNT"/>
          <bitfield caption="Packet" mask="0x00010000" name="PACKET"/>
          <bitfield caption="Locked" mask="0x00020000" name="LOCKED"/>
          <bitfield caption="Armed" mask="0x00040000" name="ARM"/>
          <bitfield caption="Active" mask="0x00080000" name="ACT"/>
          <bitfield caption="Pending" mask="0x00100000" name="PENDING"/>
          <bitfield caption="Deactivating" mask="0x00200000" name="DEACT"/>
        </register>
        <register caption="PktRx Next Buffer Data Address" name="SPW_PKTRX1_NXTBUFDATAADDR" offset="0x830" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktRx Next Buffer Data Length" name="SPW_PKTRX1_NXTBUFDATALEN" offset="0x834" rw="RW" size="4">
          <bitfield caption="Length" mask="0x00FFFFFF" name="LEN"/>
        </register>
        <register caption="PktRx Next Buffer Packet Address" name="SPW_PKTRX1_NXTBUFPKTADDR" offset="0x838" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktRx Next Buffer Config" name="SPW_PKTRX1_NXTBUFCFG" offset="0x83C" rw="RW" size="4">
          <bitfield caption="Max Count" mask="0x0000FFFF" name="MAXCNT"/>
          <bitfield caption="Start Value" mask="0x003F0000" name="VALUE"/>
          <bitfield caption="Start Mode" mask="0x01C00000" name="START" values="SPW_PKTRX1_NXTBUFCFG__START"/>
          <bitfield caption="Split Pkt" mask="0x40000000" name="SPLIT"/>
        </register>
        <register caption="PktRx Current Buffer Data Address" name="SPW_PKTRX1_CURBUFDATAADDR" offset="0x840" rw="R" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktRx Current Buffer Data Length" name="SPW_PKTRX1_CURBUFDATALEN" offset="0x844" rw="R" size="4">
          <bitfield caption="Length" mask="0x00FFFFFF" name="LEN"/>
        </register>
        <register caption="PktRx Current Buffer Packet Address" name="SPW_PKTRX1_CURBUFPKTADDR" offset="0x848" rw="R" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktRx Current Buffer Config" name="SPW_PKTRX1_CURBUFCFG" offset="0x84C" rw="RW" size="4">
          <bitfield caption="Max Count" mask="0x0000FFFF" name="MAXCNT"/>
          <bitfield caption="Split" mask="0x40000000" name="SPLIT"/>
          <bitfield caption="Abort" mask="0x80000000" name="ABORT"/>
        </register>
        <register caption="PktRx Previous Buffer Data Length" name="SPW_PKTRX1_PREVBUFDATALEN" offset="0x850" rw="R" size="4">
          <bitfield caption="Length" mask="0x00FFFFFF" name="LEN"/>
        </register>
        <register caption="PktRx Previous Buffer Status" name="SPW_PKTRX1_PREVBUFSTS" offset="0x854" rw="R" size="4">
          <bitfield caption="Count" mask="0x0000FFFF" name="CNT"/>
          <bitfield caption="EEP seen" mask="0x00010000" name="EEP"/>
          <bitfield caption="Buffer Info Full" mask="0x00020000" name="FULLI"/>
          <bitfield caption="Buffer Data Full" mask="0x00040000" name="FULLD"/>
          <bitfield caption="DMA Error" mask="0x00080000" name="DMAERR"/>
          <bitfield caption="Locked" mask="0x80000000" name="LOCKED"/>
        </register>
        <register caption="PktRx Software Reset" name="SPW_PKTRX1_SWRESET" offset="0x87C" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="PktTx Pending Read Masked Interrupt" name="SPW_PKTTX1_PI_RM" offset="0xC00" rw="R" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Pending Read and Clear Masked Interrupt" name="SPW_PKTTX1_PI_RCM" offset="0xC04" rw="R" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Pending Read Interrupt" name="SPW_PKTTX1_PI_R" offset="0xC08" rw="R" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
