Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
      <value-group caption="" name="SPW_PKTTX1_STATUS__PREV">
        <value caption="No information. Field not locked." name="NOINFO" value="0x0"/>
        <value caption="Last send list fully done" name="LASTSENDLISTOK" value="0x1"/>
        <value caption="Aborted due to memory access error." name="ABORTEDMEMERR" value="0x2"/>
        <value caption="Aborted by new send list." name="ABORTEDNEWSD" value="0x3"/>
        <value caption="Aborted by direct user command." name="ABORTEDUSERCMD" value="0x4"/>
        <value caption="Aborted by timeout." name="ABORTEDTIMEOUT" value="0x5"/>
      </value-group>
      <value-group caption="" name="SPW_PKTTX1_NXTSENDCFG__START">
        <value caption="Start if any bit in Start Value matches an incoming event" name="STARTEVENT" value="0x0"/>
        <value caption="Start immediately, if possible" name="STARTNOW" value="0x1"/>
        <value caption="Start if Start Value matches an incoming Time Code from Time Code Handler 1" name="STARTTCH1" value="0x2"/>
      </value-group>
      <value-group caption="" name="SPW_RMAP1_STS_RC__ERRCODE">
        <value caption="No error detected" name="NOERROR" value="0x0"/>
        <value caption="Error while DMA accessing the internal bus, e.g. illegal address." name="DMAERROR" value="0x1"/>
        <value caption="Unused RMAP command according to [RMAP]" name="RMAPERROR" value="0x2"/>
        <value caption="Destination key error" name="DESTKEYERROR" value="0x3"/>
        <value caption="Data CRC error" name="DATACRCERROR" value="0x4"/>
        <value caption="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." name="EOPERROR" value="0x5"/>
        <value caption="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." name="CARGOERROR" value="0x6"/>
        <value caption="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." name="EEPERROR" value="0x7"/>
        <value caption="Authorisation error:Invalid or unsupported command." name="CMDERROR" value="0xA"/>
        <value caption="Non-matching Target Logical Address." name="TLAERROR" value="0xC"/>
        <value caption="Incorrect header CRC." name="HEADERCRCERROR" value="0x10"/>
        <value caption="Protocol Identifier not supported." name="PROTOCOLIDERROR" value="0x11"/>
        <value caption="Unsupported reply address length" name="REPLYADDERROR" value="0x12"/>
      </value-group>
      <value-group caption="" name="SPW_RMAP1_STS__ERRCODE">
        <value caption="No error detected" name="NOERROR" value="0x0"/>
        <value caption="Error while DMA accessing the internal bus, e.g. illegal address." name="DMAERROR" value="0x1"/>
        <value caption="Unused RMAP command according to [RMAP]" name="RMAPERROR" value="0x2"/>
        <value caption="Destination key error" name="DESTKEYERROR" value="0x3"/>
        <value caption="Data CRC error" name="DATACRCERROR" value="0x4"/>
        <value caption="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." name="EOPERROR" value="0x5"/>
        <value caption="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." name="CARGOERROR" value="0x6"/>
        <value caption="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." name="EEPERROR" value="0x7"/>
        <value caption="Authorisation error:Invalid or unsupported command." name="CMDERROR" value="0xA"/>
        <value caption="Non-matching Target Logical Address." name="TLAERROR" value="0xC"/>
        <value caption="Incorrect header CRC." name="HEADERCRCERROR" value="0x10"/>
        <value caption="Protocol Identifier not supported." name="PROTOCOLIDERROR" value="0x11"/>
        <value caption="Unsupported reply address length" name="REPLYADDERROR" value="0x12"/>
      </value-group>
    </module>
    <module name="SUPC" caption="Supply Controller" id="44082" version="C">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Timing Domain Crystal Oscillator Select" mask="0x00000008" name="TDXTALSEL" values="SUPC_CR__TDXTALSEL"/>
          <bitfield caption="Monitoring Domain Crystal Oscillator Select" mask="0x00000010" name="MDXTALSEL" values="SUPC_CR__MDXTALSEL"/>
          <bitfield caption="Monitoring Domain RC Oscillator Select" mask="0x00000020" name="MDRCSEL" values="SUPC_CR__MDRCSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Core Supply Monitor User Selection" mask="0x00800000" name="CORESMUSEL"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="VDDCORE Supply Monitor Reset Enable" mask="0x00001000" name="CORSMRSTEN" values="SUPC_MR__CORSMRSTEN"/>
          <bitfield caption="VDDCORE Supply Monitor Disable" mask="0x00002000" name="CORSMDIS" values="SUPC_MR__CORSMDIS"/>
          <bitfield caption="Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="Fast Startup 32.768 kHz Crystal Oscillator" mask="0x00400000" name="FXTALSTUP"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="VDDCORE Supply Monitor Reset Status (cleared on read)" mask="0x00000008" name="CORSMRSTS" values="SUPC_SR__CORSMRSTS"/>
          <bitfield caption="32 kHz Oscillator Selection Status" mask="0x00000080" name="TDOSCSEL" values="SUPC_SR__TDOSCSEL"/>
        </register>
        <register caption="Supply Controller Power Register" name="SUPC_PWR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Monitoring Oscillator Selection Status" mask="0x00040000" name="MONSELS" values="SUPC_PWR__MONSELS"/>
        </register>
        <register caption="Write Protection Mode Register" name="SYSC_WPMR" offset="0xD4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key." mask="0xFFFFFF00" name="WPKEY" values="SYSC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__TDXTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock of the timing domain (TD_SLCK) on the 32.768 kHz crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__MDXTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock of the monitoring domain (MD_SLCK) on the 32.768 kHz crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__MDRCSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock of the monitoring domain (MD_SLCK) on the slow RC oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__CORSMRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a VDDCORE supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal, vddcore_nreset is asserted when a VDDCORE supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__CORSMDIS">
        <value caption="The VDDCORE supply monitor is enabled." name="ENABLE" value="0"/>
        <value caption="The VDDCORE supply monitor is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on the value of XTALSEL (SUPC_CR)." name="NO_EFFECT" value="0"/>
        <value caption="The 32.768 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__CORSMRSTS">
        <value caption="No VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__TDOSCSEL">
        <value caption="The timing domain slow clock, TD_SLCK, is generated by the slow RC oscillator." name="RC" value="0"/>
        <value caption="The timing domain slow clock, TD_SLCK, is generated by the 32.768 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
