Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
      <value-group caption="" name="XDMAC_CNDC__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CNDC__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__PROT">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__SIF">
        <value caption="The data is read through system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__DIF">
        <value caption="The data is written through system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__PERID">
        <value caption="FLEXCOM0_TX" name="FLEXCOM0_TX" value="0"/>
        <value caption="FLEXCOM0_RX" name="FLEXCOM0_RX" value="1"/>
        <value caption="FLEXCOM1_TX" name="FLEXCOM1_TX" value="2"/>
        <value caption="FLEXCOM1_RX" name="FLEXCOM1_RX" value="3"/>
        <value caption="FLEXCOM2_TX" name="FLEXCOM2_TX" value="4"/>
        <value caption="FLEXCOM2_RX" name="FLEXCOM2_RX" value="5"/>
        <value caption="FLEXCOM3_TX" name="FLEXCOM3_TX" value="6"/>
        <value caption="FLEXCOM3_RX" name="FLEXCOM3_RX" value="7"/>
        <value caption="FLEXCOM4_TX" name="FLEXCOM4_TX" value="8"/>
        <value caption="FLEXCOM4_RX" name="FLEXCOM4_RX" value="9"/>
        <value caption="FLEXCOM5_TX" name="FLEXCOM5_TX" value="10"/>
        <value caption="FLEXCOM5_RX" name="FLEXCOM5_RX" value="11"/>
        <value caption="FLEXCOM6_TX" name="FLEXCOM6_TX" value="12"/>
        <value caption="FLEXCOM6_RX" name="FLEXCOM6_RX" value="13"/>
        <value caption="FLEXCOM7_TX" name="FLEXCOM7_TX" value="14"/>
        <value caption="FLEXCOM7_RX" name="FLEXCOM7_RX" value="15"/>
        <value caption="FLEXCOM8_TX" name="FLEXCOM8_TX" value="16"/>
        <value caption="FLEXCOM8_RX" name="FLEXCOM8_RX" value="17"/>
        <value caption="FLEXCOM9_TX" name="FLEXCOM9_TX" value="18"/>
        <value caption="FLEXCOM9_RX" name="FLEXCOM9_RX" value="19"/>
        <value caption="QSPI_TX" name="QSPI_TX" value="20"/>
        <value caption="QSPI_RX" name="QSPI_RX" value="21"/>
        <value caption="PWM0" name="PWM0" value="22"/>
        <value caption="PWM1" name="PWM1" value="23"/>
        <value caption="TC0" name="TC0" value="24"/>
        <value caption="TC1" name="TC1" value="25"/>
        <value caption="TC2" name="TC2" value="26"/>
        <value caption="TC3" name="TC3" value="27"/>
        <value caption="SHA" name="SHA" value="28"/>
        <value caption="TC1_CPA" name="TC1_CPA" value="29"/>
        <value caption="TC4_CPA" name="TC4_CPA" value="30"/>
        <value caption="TC7_CPA" name="TC7_CPA" value="31"/>
        <value caption="TC10_CPA" name="TC10_CPA" value="32"/>
        <value caption="TC1_CPB" name="TC1_CPB" value="33"/>
        <value caption="TC4_CPB" name="TC4_CPB" value="34"/>
        <value caption="TC7_CPB" name="TC7_CPB" value="35"/>
        <value caption="TC10_CPB" name="TC10_CPB" value="36"/>
        <value caption="TC1_CPC" name="TC1_CPC" value="37"/>
        <value caption="TC4_CPC" name="TC4_CPC" value="38"/>
        <value caption="TC7_CPC" name="TC7_CPC" value="39"/>
        <value caption="TC10_CPC" name="TC10_CPC" value="40"/>
        <value caption="TC1_ETRG" name="TC1_ETRG" value="41"/>
        <value caption="TC4_ETRG" name="TC4_ETRG" value="42"/>
        <value caption="TC7_ETRG" name="TC7_ETRG" value="43"/>
        <value caption="TC10_ETRG" name="TC10_ETRG" value="44"/>
      </value-group>
    </module>
    <module name="FUSES" id="1" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield caption="Debug interface Selection" mask="0x00000002" name="DEBUG_INTF" values="USER_WORD_0__DEBUG_INTF"/>
          <bitfield caption="PFD Trim value" mask="0x00000700" name="PFD_TRIM"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield caption="RC Temperature Trim" mask="0x00000003" name="RC_TTRIM"/>
          <bitfield caption="RC2 Temperature Trim" mask="0x0000000C" name="RC2_TTRIM"/>
          <bitfield caption="RC Frequency Trim 4MHz" mask="0x00000070" name="RC_FTRIM_4MHZ"/>
          <bitfield caption="RC Frequency Trim 8MHz" mask="0x00000380" name="RC_FTRIM_8MHZ"/>
          <bitfield caption="RC Frequency Trim 10MHz" mask="0x00001C00" name="RC_FTRIM_10MHZ"/>
          <bitfield caption="RC Frequency Trim 12MHz" mask="0x0000E000" name="RC_FTRIM_12MHZ"/>
          <bitfield caption="RC2 Frequency Trim 4MHz" mask="0x00070000" name="RC2_FTRIM_4MHZ"/>
          <bitfield caption="RC2 Frequency Trim 8MHz" mask="0x00380000" name="RC2_FTRIM_8MHZ"/>
          <bitfield caption="RC2 Frequency Trim 10MHz" mask="0x01C00000" name="RC2_FTRIM_10MHZ"/>
          <bitfield caption="RC2 Frequency Trim 12MHz" mask="0x0E000000" name="RC2_FTRIM_12MHZ"/>
        </register>
        <register name="USER_WORD_2" offset="0x8" size="4" rw="RW" caption="USER Page Word 2">
          <bitfield caption="RC Temperature Trim" mask="0x00000003" name="RC_TTRIM"/>
          <bitfield caption="RC2 Temperature Trim" mask="0x0000000C" name="RC2_TTRIM"/>
          <bitfield caption="RC Frequency Trim 4MHz" mask="0x00000070" name="RC_FTRIM_4MHZ"/>
          <bitfield caption="RC Frequency Trim 8MHz" mask="0x00000380" name="RC_FTRIM_8MHZ"/>
          <bitfield caption="RC Frequency Trim 10MHz" mask="0x00001C00" name="RC_FTRIM_10MHZ"/>
          <bitfield caption="RC Frequency Trim 12MHz" mask="0x0000E000" name="RC_FTRIM_12MHZ"/>
          <bitfield caption="RC2 Frequency Trim 4MHz" mask="0x00070000" name="RC2_FTRIM_4MHZ"/>
          <bitfield caption="RC2 Frequency Trim 8MHz" mask="0x00380000" name="RC2_FTRIM_8MHZ"/>
          <bitfield caption="RC2 Frequency Trim 10MHz" mask="0x01C00000" name="RC2_FTRIM_10MHZ"/>
          <bitfield caption="RC2 Frequency Trim 12MHz" mask="0x0E000000" name="RC2_FTRIM_12MHZ"/>
        </register>
        <register name="USER_WORD_3" offset="0xC" size="4" rw="RW" caption="USER Page Word 3">
          <bitfield caption="RC Temperature Trim" mask="0x00000003" name="RC_TTRIM"/>
          <bitfield caption="RC2 Temperature Trim" mask="0x0000000C" name="RC2_TTRIM"/>
          <bitfield caption="RC Frequency Trim 4MHz" mask="0x00000070" name="RC_FTRIM_4MHZ"/>
          <bitfield caption="RC Frequency Trim 8MHz" mask="0x00000380" name="RC_FTRIM_8MHZ"/>
          <bitfield caption="RC Frequency Trim 10MHz" mask="0x00001C00" name="RC_FTRIM_10MHZ"/>
          <bitfield caption="RC Frequency Trim 12MHz" mask="0x0000E000" name="RC_FTRIM_12MHZ"/>
          <bitfield caption="RC2 Frequency Trim 4MHz" mask="0x00070000" name="RC2_FTRIM_4MHZ"/>
          <bitfield caption="RC2 Frequency Trim 8MHz" mask="0x00380000" name="RC2_FTRIM_8MHZ"/>
          <bitfield caption="RC2 Frequency Trim 10MHz" mask="0x01C00000" name="RC2_FTRIM_10MHZ"/>
          <bitfield caption="RC2 Frequency Trim 12MHz" mask="0x0E000000" name="RC2_FTRIM_12MHZ"/>
        </register>
      </register-group>
      <value-group caption="Debug interface mode" name="USER_WORD_0__DEBUG_INTF">
        <value caption="JTAG" name="JTAG" value="0x0"/>
        <value caption="SWD" name="SWD" value="0x1"/>
      </value-group>
    </module>
    <module name="LOCKBIT" id="1" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits" name="LOCKBIT" offset="0x0" rw="RW" size="4">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
          <bitfield caption="Lock Region 16" mask="0x00010000" name="LOCK_REGION_16"/>
          <bitfield caption="Lock Region 17" mask="0x00020000" name="LOCK_REGION_17"/>
          <bitfield caption="Lock Region 18" mask="0x00040000" name="LOCK_REGION_18"/>
          <bitfield caption="Lock Region 19" mask="0x00080000" name="LOCK_REGION_19"/>
          <bitfield caption="Lock Region 20" mask="0x00100000" name="LOCK_REGION_20"/>
          <bitfield caption="Lock Region 21" mask="0x00200000" name="LOCK_REGION_21"/>
          <bitfield caption="Lock Region 22" mask="0x00400000" name="LOCK_REGION_22"/>
          <bitfield caption="Lock Region 23" mask="0x00800000" name="LOCK_REGION_23"/>
          <bitfield caption="Lock Region 24" mask="0x01000000" name="LOCK_REGION_24"/>
          <bitfield caption="Lock Region 25" mask="0x02000000" name="LOCK_REGION_25"/>
          <bitfield caption="Lock Region 26" mask="0x04000000" name="LOCK_REGION_26"/>
          <bitfield caption="Lock Region 27" mask="0x08000000" name="LOCK_REGION_27"/>
          <bitfield caption="Lock Region 28" mask="0x10000000" name="LOCK_REGION_28"/>
          <bitfield caption="Lock Region 29" mask="0x20000000" name="LOCK_REGION_29"/>
          <bitfield caption="Lock Region 30" mask="0x40000000" name="LOCK_REGION_30"/>
          <bitfield caption="Lock Region 31" mask="0x80000000" name="LOCK_REGION_31"/>
        </register>
      </register-group>
    </module>
