Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.0.89/samrh71c/atdf/ATSAMRH71F20C.atdf
        <register offset="0x00000014" size="4" name="MVFR1" initval="0x11000011" rw="R" caption="Media and VFP Feature Register 1">
          <bitfield mask="0x0000000F" name="FtZ_mode" caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
          <bitfield mask="0x000000F0" name="D_NaN_mode" caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
          <bitfield mask="0x0F000000" name="FP_HPFP" caption="Floating Point Half-Precision and double-precision"/>
          <bitfield mask="0xF0000000" name="FP_fused_MAC" caption="Indicates whether the FP supports fused multiply accumulate operations"/>
        </register>
        <register offset="0x00000018" size="4" name="MVFR2" initval="0x00000040" rw="R" caption="Media and VFP Feature Register 2">
          <bitfield mask="0x000000F0" name="VFP_Misc" caption="Indicates the hardware support for FP miscellaneous features"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="CQFP256">
      <pin position="1" pad="GNDCORE"/>
      <pin position="2" pad="VDDCORE"/>
      <pin position="3" pad="PF29"/>
      <pin position="4" pad="PF30"/>
      <pin position="5" pad="ATXOUTN"/>
      <pin position="6" pad="ATXOUTP"/>
      <pin position="7" pad="ARXINN"/>
      <pin position="8" pad="ARXINP"/>
      <pin position="9" pad="PA0"/>
      <pin position="10" pad="PA1"/>
      <pin position="11" pad="PA2"/>
      <pin position="12" pad="PA3"/>
      <pin position="13" pad="PA4"/>
      <pin position="14" pad="PA5"/>
      <pin position="15" pad="PA6"/>
      <pin position="16" pad="PA7"/>
      <pin position="17" pad="PA8"/>
      <pin position="18" pad="PA9"/>
      <pin position="19" pad="PA10"/>
      <pin position="20" pad="PA11"/>
      <pin position="21" pad="PA12"/>
      <pin position="22" pad="PA13"/>
      <pin position="23" pad="TST"/>
      <pin position="24" pad="JTAGSEL"/>
      <pin position="25" pad="NMIC_NMI"/>
      <pin position="26" pad="PA16"/>
      <pin position="27" pad="PA17"/>
      <pin position="28" pad="NRST"/>
      <pin position="29" pad="PA19"/>
      <pin position="30" pad="PA20"/>
      <pin position="31" pad="PA21"/>
      <pin position="32" pad="VDDIO"/>
      <pin position="33" pad="GNDIO"/>
      <pin position="34" pad="PA22"/>
      <pin position="35" pad="PA23"/>
      <pin position="36" pad="PA24"/>
      <pin position="37" pad="PA25"/>
      <pin position="38" pad="PA26"/>
      <pin position="39" pad="PA27"/>
      <pin position="40" pad="PA28"/>
      <pin position="41" pad="SPWDINP1"/>
      <pin position="42" pad="SPWDINN1"/>
      <pin position="43" pad="SPWDOUTP1"/>
      <pin position="44" pad="SPWDOUTN1"/>
      <pin position="45" pad="SPWREF1"/>
      <pin position="46" pad="SPWSOUTP1"/>
      <pin position="47" pad="SPWSOUTN1"/>
      <pin position="48" pad="SPWSINP1"/>
      <pin position="49" pad="SPWSINN1"/>
      <pin position="50" pad="SPWDINP0"/>
      <pin position="51" pad="SPWDINN0"/>
      <pin position="52" pad="SPWDOUTP0"/>
      <pin position="53" pad="SPWDOUTN0"/>
      <pin position="54" pad="SPWREF0"/>
      <pin position="55" pad="SPWSOUTP0"/>
      <pin position="56" pad="SPWSOUTN0"/>
      <pin position="57" pad="SPWSINP0"/>
      <pin position="58" pad="SPWSINN0"/>
      <pin position="59" pad="PB0"/>
      <pin position="60" pad="PB1"/>
      <pin position="61" pad="PB2"/>
      <pin position="62" pad="PB3"/>
      <pin position="63" pad="VDDCORE"/>
      <pin position="64" pad="GNDCORE"/>
      <pin position="65" pad="GNDCORE"/>
      <pin position="66" pad="VDDCORE"/>
      <pin position="67" pad="PB4"/>
      <pin position="68" pad="PB5"/>
      <pin position="69" pad="PB6"/>
      <pin position="70" pad="PB7"/>
      <pin position="71" pad="PB8"/>
      <pin position="72" pad="PB9"/>
      <pin position="73" pad="PB10"/>
      <pin position="74" pad="PB11"/>
      <pin position="75" pad="PB12"/>
      <pin position="76" pad="PB13"/>
      <pin position="77" pad="PB14"/>
      <pin position="78" pad="PB15"/>
      <pin position="79" pad="PB16"/>
      <pin position="80" pad="XOUT"/>
      <pin position="81" pad="XIN"/>
      <pin position="82" pad="VDD18_PLLA"/>
      <pin position="83" pad="GND_PLLA"/>
      <pin position="84" pad="GND_PLLB"/>
      <pin position="85" pad="VDD18_PLLB"/>
      <pin position="86" pad="PB17"/>
      <pin position="87" pad="PB18"/>
      <pin position="88" pad="PB19"/>
      <pin position="89" pad="PB20"/>
      <pin position="90" pad="PB21"/>
      <pin position="91" pad="PB22"/>
      <pin position="92" pad="PB23"/>
      <pin position="93" pad="PB24"/>
      <pin position="94" pad="PB25"/>
      <pin position="95" pad="PB26"/>
      <pin position="96" pad="VDDIO"/>
      <pin position="97" pad="GNDIO"/>
      <pin position="98" pad="PB27"/>
      <pin position="99" pad="PB28"/>
      <pin position="100" pad="PB29"/>
      <pin position="101" pad="PC0"/>
      <pin position="102" pad="PC1"/>
      <pin position="103" pad="PC2"/>
      <pin position="104" pad="PC3"/>
      <pin position="105" pad="PC4"/>
      <pin position="106" pad="PC5"/>
      <pin position="107" pad="PC6"/>
      <pin position="108" pad="PC7"/>
      <pin position="109" pad="PC8"/>
      <pin position="110" pad="PC9"/>
      <pin position="111" pad="PC10"/>
      <pin position="112" pad="PC11"/>
      <pin position="113" pad="PC12"/>
      <pin position="114" pad="PC13"/>
      <pin position="115" pad="PC14"/>
      <pin position="116" pad="PC15"/>
      <pin position="117" pad="PC16"/>
      <pin position="118" pad="PC17"/>
      <pin position="119" pad="PC18"/>
      <pin position="120" pad="PC19"/>
      <pin position="121" pad="PC20"/>
      <pin position="122" pad="PC21"/>
      <pin position="123" pad="PC22"/>
      <pin position="124" pad="PC23"/>
      <pin position="125" pad="PC24"/>
      <pin position="126" pad="PC25"/>
      <pin position="127" pad="VDDCORE"/>
      <pin position="128" pad="GNDCORE"/>
      <pin position="129" pad="GNDCORE"/>
      <pin position="130" pad="VDDCORE"/>
      <pin position="131" pad="PC26"/>
      <pin position="132" pad="PC27"/>
      <pin position="133" pad="PC28"/>
      <pin position="134" pad="PC29"/>
      <pin position="135" pad="PC30"/>
      <pin position="136" pad="PC31"/>
      <pin position="137" pad="PE12"/>
      <pin position="138" pad="PE11"/>
      <pin position="139" pad="PE10"/>
      <pin position="140" pad="PE9"/>
      <pin position="141" pad="PE8"/>
      <pin position="142" pad="PE7"/>
      <pin position="143" pad="PE6"/>
      <pin position="144" pad="PE5"/>
      <pin position="145" pad="PE4"/>
      <pin position="146" pad="PE3"/>
      <pin position="147" pad="PE2"/>
      <pin position="148" pad="PE1"/>
      <pin position="149" pad="PE0"/>
      <pin position="150" pad="PF0"/>
      <pin position="151" pad="PF1"/>
      <pin position="152" pad="PF2"/>
      <pin position="153" pad="PF3"/>
      <pin position="154" pad="PF4"/>
      <pin position="155" pad="PF5"/>
      <pin position="156" pad="PF6"/>
      <pin position="157" pad="PF7"/>
      <pin position="158" pad="PF8"/>
      <pin position="159" pad="PF9"/>
      <pin position="160" pad="VDDIO"/>
      <pin position="161" pad="GNDIO"/>
      <pin position="162" pad="PF10"/>
      <pin position="163" pad="PD0"/>
      <pin position="164" pad="PD1"/>
      <pin position="165" pad="PD2"/>
      <pin position="166" pad="PD3"/>
      <pin position="167" pad="PD4"/>
      <pin position="168" pad="PD5"/>
      <pin position="169" pad="PD6"/>
      <pin position="170" pad="PD7"/>
      <pin position="171" pad="PD8"/>
      <pin position="172" pad="PD9"/>
      <pin position="173" pad="PD10"/>
      <pin position="174" pad="PD11"/>
      <pin position="175" pad="PD12"/>
      <pin position="176" pad="PD13"/>
      <pin position="177" pad="PD14"/>
      <pin position="178" pad="PD15"/>
      <pin position="179" pad="PD16"/>
      <pin position="180" pad="PD17"/>
      <pin position="181" pad="PD18"/>
      <pin position="182" pad="PD19"/>
      <pin position="183" pad="PD20"/>
      <pin position="184" pad="PD21"/>
      <pin position="185" pad="PD22"/>
      <pin position="186" pad="PD23"/>
      <pin position="187" pad="PD24"/>
      <pin position="188" pad="PD25"/>
      <pin position="189" pad="PD26"/>
      <pin position="190" pad="PD27"/>
      <pin position="191" pad="VDDCORE"/>
      <pin position="192" pad="GNDCORE"/>
      <pin position="193" pad="GNDCORE"/>
      <pin position="194" pad="VDDCORE"/>
      <pin position="195" pad="PD28"/>
      <pin position="196" pad="PD29"/>
      <pin position="197" pad="PD30"/>
      <pin position="198" pad="PD31"/>
      <pin position="199" pad="PG0"/>
      <pin position="200" pad="PG1"/>
      <pin position="201" pad="PG2"/>
      <pin position="202" pad="PG3"/>
      <pin position="203" pad="PG4"/>
      <pin position="204" pad="PG5"/>
      <pin position="205" pad="PG6"/>
      <pin position="206" pad="PG7"/>
      <pin position="207" pad="PG8"/>
      <pin position="208" pad="PG9"/>
      <pin position="209" pad="PG10"/>
      <pin position="210" pad="PG11"/>
      <pin position="211" pad="PG12"/>
      <pin position="212" pad="PG13"/>
      <pin position="213" pad="PG14"/>
      <pin position="214" pad="PG15"/>
      <pin position="215" pad="PG16"/>
      <pin position="216" pad="PG17"/>
      <pin position="217" pad="PG18"/>
      <pin position="218" pad="PG19"/>
      <pin position="219" pad="PG20"/>
      <pin position="220" pad="PG21"/>
      <pin position="221" pad="PG22"/>
      <pin position="222" pad="PG23"/>
      <pin position="223" pad="PG24"/>
      <pin position="224" pad="VDDIO"/>
      <pin position="225" pad="GNDIO"/>
      <pin position="226" pad="PG25"/>
      <pin position="227" pad="PG26"/>
      <pin position="228" pad="PG27"/>
      <pin position="229" pad="XOUT32"/>
      <pin position="230" pad="XIN32"/>
      <pin position="231" pad="PG30"/>
      <pin position="232" pad="PG31"/>
      <pin position="233" pad="PF11"/>
      <pin position="234" pad="PF12"/>
      <pin position="235" pad="PF13"/>
      <pin position="236" pad="PF14"/>
      <pin position="237" pad="PF15"/>
      <pin position="238" pad="PF16"/>
      <pin position="239" pad="PF17"/>
      <pin position="240" pad="PF18"/>
      <pin position="241" pad="PF19"/>
      <pin position="242" pad="PF20"/>
      <pin position="243" pad="PF21"/>
      <pin position="244" pad="PF22"/>
      <pin position="245" pad="PF23"/>
      <pin position="246" pad="PF24"/>
      <pin position="247" pad="PF25"/>
      <pin position="248" pad="BTXOUTN"/>
      <pin position="249" pad="BTXOUTP"/>
      <pin position="250" pad="BRXINN"/>
      <pin position="251" pad="BRXINP"/>
      <pin position="252" pad="PF26"/>
      <pin position="253" pad="PF27"/>
      <pin position="254" pad="PF28"/>
      <pin position="255" pad="VDDCORE"/>
      <pin position="256" pad="GNDCORE"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
